{
  "698": {
    "session_id": 698,
    "session_title": "Qt and Windows 10",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:00",
    "session_end_time": "13:30",
    "session_room": "a1",
    "session_pdf_title": "Qt and Windows 10",
    "session_pdf_url": false,
    "session_abstract": "<p>Microsoft went through a significant technology and focus shift recently, unifying their platforms towards Windows 10 everywhere. However, there is a lot of confusion what this actually implies to companies and individual developers. </p>\n<p>What versions of Windows 10 will exist (Windows 10 Home/Pro, Windows 10 Mobile (Enterprise), Windows 10 IoT Core, …)? How do they relate to each other? What is the situation on embedded and mobile, and with Microsoft's Internet of Things strategy? And lastly, what happens to existing Qt solutions, and what is the Qt offering for the whole Windows 10 ecosystem?</p>\n<p>This talks aims to provide a quick and easy-to-follow summary on the Microsoft product strategy and more importantly how Qt fits into this picture.</p>\n<p>Qt is the layer providing stability against platform changes, either from the platform vendor or project related requirements changing. By using Qt the project is not tied to a specific platform, even more it easily allows to transform an application project towards an embedded system.</p>\n<p>This is part 1 of Windows 10 related submissions. Part 2 will talk about the technical details to use Qt on Windows 10.</p>\n",
    "session_speaker_name": "Maurice Kalinowski",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Maurice Kalinowski works for the Qt Company as Senior R&D Manager, Tools and Framework. He started at Trolltech GmbH in Germany in 2006, working on the initial Windows CE 5 port. Following that he worked on multiple areas in regards to developer offering in Nokia: Qt Simulator, Qt Installer Framework, and (Nokia) Qt SDK. </p>\n"
  },
  "699": {
    "session_id": 699,
    "session_title": "Qt&#8217;s Web Offering &#8211; An Overview",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:30",
    "session_end_time": "14:00",
    "session_room": "a1",
    "session_pdf_title": "Qt&#8217;s Web Offering &#8211; An Overview",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt provides several components for integrating or interfacing with web content.<br />\nWith Qt WebEngine we have a very strong offering for HTML5 content that supports many different web technologies. This in particular includes WebRTC, WebGL and WebSockets. However, Qt WebEngine is not the only web related offering that is provided with Qt. There is also a Qt WebView module, which provides a consistent API for native web views and falls back to Qt WebEngine, if a native web view is not available. Qt WebChannel can be used to expose QObjects to any JavaScript context and thereby allows the development of a whole range of hybrid applications. The Qt WebSockets module provides an implementation of the WebSocket protocol, allowing us to communicate with WebSocket services or to implement a WebSocket service using C++ and QML API.</p>\n<p>In this talk we will provide a quick overview of these components, discuss their functionality and outline some potential use cases for the web-related components and technologies provided by Qt.</p>\n",
    "session_speaker_name": "Allan Jensen",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Allan is a senior software developer at The Qt Company. He studied Computer Science at Copenhagen University, has been a contributor to KDE since 2001 and is a former maintainer of KHTML. Since joining Nokia in 2011 he has been working in the QtWebKit team.</p>\n"
  },
  "702": {
    "session_id": 702,
    "session_title": "Creating IoT applications with Bluetooth Low Energy and Qt",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:15",
    "session_end_time": "15:15",
    "session_room": "a1",
    "session_pdf_title": "Creating IoT applications with Bluetooth Low Energy and Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Over 10 billion devices which use Bluetooth were shipped in the technology's first 10 years. But in 2013 alone, a further 2.5 billion new Bluetooth devices materialised and more than 3 billion in 2014. Bluetooth is going through what has been described as \"quiet revolution\", with massive and increasing levels of adoption driven by the release of the latest version of Bluetooth called \"Bluetooth Smart\".  Bluetooth Smart enables some exciting and very current technology trends such as IoT (Internet of Things), Wearable Technology, the Smart Home and Beacons.</p>\n<p>Goldman Sachs wrote an interesting report which categorised the growth of the internet as progressing through three “waves”. In the first wave, one billion PCs were connected to the internet. In the second, smart phones took us to two billion devices. But in the third wave…. the Internet of Things, they forecast there will be 18 billion devices connected to the internet by 2020. And Bluetooth Smart is the killer wireless enabler for the IoT so learning about Bluetooth Smart is a must for any developer set on exploiting the biggest opportunity we’ve seen in a long time!</p>\n<p>In this session you will learn about the fundamental concepts and architecture of Bluetooth Smart, how the Qt APIs make Bluetooth Smart capabilities available to applications and about tools that will help you. There will be slides. There will be code. There may even be demos :-)</p>\n",
    "session_speaker_name": "Martin Woolley",
    "session_speaker_company": "Bluetooth SIG",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Martin Woolley is an industry veteran with over 30 years’ experience working with computers large, small and getting smaller. He still has a Sinclair ZX81 somewhere. When Martin first discovered Bluetooth Smart (AKA Bluetooth Low Energy) it struck him as a phenomenally exciting, useful and developer-friendly technology and a perfect fit in this age of the Internet of Things. Martin is a member of the SIG's Developer Programs and Evangelism team and thoroughly enjoys talking with developers about software development and Bluetooth Smart. He used to work for BlackBerry and loved using Qt to develop applications for BlackBerry 10. QML rocks :-)</p>\n"
  },
  "703": {
    "session_id": 703,
    "session_title": "Rising Trends in 3D in user interfaces",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:00",
    "session_end_time": "16:30",
    "session_room": "a1",
    "session_pdf_title": "Rising Trends in 3D in user interfaces",
    "session_pdf_url": false,
    "session_abstract": "<p>For the past 20 years, Qt has delivered all the tools and libraries for creating the best possible user experience for your end users, from classic desktop look-and-feel to fluent, modern touch-based user interfaces. Today, the future of UIs is pointing towards 3D.</p>\n<p>We are seeing unprecedented development in Augmented Reality and Virtual Reality both in display technologies and 3D depth sensing of the surrounding environment. Combining these enables immersive user experiences as we have already seen in products like Microsoft HoloLens and Oculus Rift. Also the user interaction will change as gesture interaction with 3D elements is providing a more natural way of interacting with 3D objects.</p>\n<p>It has been possible to integrate 3D content with Qt UIs easily. Starting from Qt 5.5 creating and integrating 3D content is even easier with the new 3D modules: Qt Canvas3D and Qt 3D. Canvas3D enables you to leverage the innovation around WebGL and utilize JavaScript 3D libraries such as three.js. This enables easy sharing of 3D content and functionality for example across web and native applications. Qt3D on the other hand provides an extensible, flexible and data driven architecture which enables quickly implementing any rendering pipeline.</p>\n<p>This talk highlights the use cases we see now and in the future around 3D and introduces how Qt is meeting the needs of the modern 3D user interfaces. The focus of the talk is more on the use of 3D instead of the underlying technology and code.</p>\n",
    "session_speaker_name": "Sami Makkonen",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Sami is working at The Qt Company R&D and holds an M.Sc.(Econ.) degree in Computer Science from the University of Jyväskylä. Sami has been working in Digia and The Qt Company for 17 years in different roles from development to program and product management. Sami has been working with Qt related projects since 2006.</p>\n"
  },
  "704": {
    "session_id": 704,
    "session_title": "Building Desktop and Embedded Uis with Qt 3D",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:30",
    "session_end_time": "17:30",
    "session_room": "a1",
    "session_pdf_title": "Building Desktop and Embedded Uis with Qt 3D",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt3D is available as a Technology Preview with Qt 5.5 and is targeting Qt 5.6 for an initial release. Qt3D provides C++ and QML APIs to allow the easy creation and integration of compelling 3D content in your Qt-based applications without having to invest time into writing a generic 3D renderer.</p>\n<p>In this live coding session we will show how to use Qt3D along with other Qt facilities to create an impressive modern user interface that combines OpenGL-based 3D content with a Qt Quick 2 user interface. We will also show techniques for integrating this with backend business logic.</p>\n<p>This session will cover the Qt3D object model and hierarchical scene graph to manage nested transformations; custom materials and shaders that can be used to achieve just the look you are after; how to create and import new geometry into your virtual world; and how to get good performance using modern GPU features.</p>\n<p>The renderer in Qt3D is completely configurable from QML and C++ APIs by means of providing a so-called, framegraph. This allows Qt3D to be configured dynamically at runtime to control the OpenGL pipeline to achieve customised rendering algorithms, special effects and post processing. We will demonstrate some interesting ways of using this flexibility within the application being built.</p>\n<p>Qt3D provides more than a 3D renderer. It is also a general purpose, soft-realtime simulation framework built on top of a highly multithreaded architecture. We will introduce some of the concepts and architecture and show how to extend Qt3D to incorporate your own features as 1st class citizens in Qt3D.</p>\n",
    "session_speaker_name": "Sean Harmer, Dr.",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Dr. Sean Harmer is a Senior Engineer and Director at KDAB. Sean has been developing with C++ and Qt since 1998, and in a commercial setting since 2002. He holds a PhD in Astrophysics along with a Masters in Mathematics and Astrophysics. Sean has a broad range of experience and is keenly interested in scientific visualisation and animation using Qt and OpenGL. Sean is the maintainer of the Qt3D module and an experienced trainer in OpenGL and Qt. He lives in the north of England and enjoys drinking tea.</p>\n"
  },
  "705": {
    "session_id": 705,
    "session_title": "Choosing the right Embedded Linux platform for your next project",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:00",
    "session_end_time": "14:00",
    "session_room": "a2",
    "session_pdf_title": "Choosing the right Embedded Linux platform for your next project",
    "session_pdf_url": false,
    "session_abstract": "<p>Getting started with Embedded Linux development can easily get complicated: after the initial headache of system images and cross-compilation, one has to deal with the question of windowing systems, the often vendor-specific bits of OpenGL integration, the handling of touch and other forms of input, the various approaches to multimedia acceleration, and many advanced, often halfway or not at all supported, use cases like outputting to multiple screens.</p>\n<p>Choosing the right embedded board and software stack is critical to the success of any project. While Qt frees developers from many of the board and vendor-specific issues of accelerated graphics, input devices and multimedia, allowing them to focus on the applications they want to build, it is still important to have an understanding of the relevant concepts and technologies. If the hardware or drivers lack support for the desired environment, graphics, or input features, Qt will not be able to fix that on its own.</p>\n<p>In Qt 5.5 the support for Linux graphics and input stacks is wider than ever. If you ever wondered why your applications fail with cryptic \"Could not create the egl surface: error = 0x3003\" errors on your brand new development board, what the difference between fbdev and KMS is, why opening a new window aborts your embedded application, or why the touchscreen does not work, this talk is for you. We are going to have an overview of the relevant windowing systems and the various ways of getting accelerated graphics onto the screen in embedded systems, while keeping it all high level enough to make the talk suitable to everyone involved in the development of embedded systems.</p>\n",
    "session_speaker_name": "Laszlo Agocs",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Laszlo is a senior software engineer at The Qt Company in Oslo, Norway. After years of UI framework development on various Nokia mobile platforms and developing mobile GPUs at ARM, he is now working full time on Qt. His focus is on graphics, platform adaptation, windowing system integration and input device handling, in particular on devices running Embedded Linux. However, in a true cross-platform Qt spirit, he is not afraid of other platforms either. He is a major contributor to QtGui, QtQuick, and is the maintainer of the embedded-focused linuxfb and eglfs platform plugins.</p>\n"
  },
  "706": {
    "session_id": 706,
    "session_title": "Qt for Device Creation",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:15",
    "session_end_time": "15:15",
    "session_room": "a2",
    "session_pdf_title": "Qt for Device Creation",
    "session_pdf_url": false,
    "session_abstract": "<p>Developing software for embedded devices presents many challenges.  The talk aims to layout what some of those challenges are how the Qt for Device Creation offering solves them.  We will discuss what tools are necessary to develop embedded software and what differences there are between each of the supported embedded platforms.  The talk will cover both the using the opensource version of Qt as well as the commercial version and what the differences are in the context of device creation.  Many live demonstrations will be used to illustrate how easy it is to develop software for embedded devices with Qt and its tooling.</p>\n",
    "session_speaker_name": "Andy Nichols",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Andy Nichols is a software engineer at The Qt Company in Olso, Norway. He has worked with Qt for almost 10 years. Andy was a Qt support engineer at Nokia for 3 years who focused on customers using Qt for embedded Linux. He later took a role as a software engineer at Nokia with the Qt graphics team where he worked on the Qt Platform Abstraction (QPA) in Qt 5 as well as the QtWayland module. Since joining The Qt Company he has been focused on Wayland, Multimedia, and the Embedded Linux and iOS ports.  Right now Andy is focused on Qt for Embedded Linux in the context of the Boot to Qt reference stack.</p>\n"
  },
  "707": {
    "session_id": 707,
    "session_title": "The Internet of Things: What Is It And Why Should I Care?",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:00",
    "session_end_time": "16:30",
    "session_room": "a2",
    "session_pdf_title": "The Internet of Things: What Is It And Why Should I Care?",
    "session_pdf_url": false,
    "session_abstract": "<p>Gartner, Inc. recently forecast that 4.9 billion connected devices will be in use in 2015, up 30 percent from 2014, and the number will reach 25 billion by 2020. They describe the Internet of Things (IoT) as \"a powerful force for business transformation, and its disruptive impact will be felt across all industries and all areas of society.\"</p>\n<p>What exactly is IoT? As a software developer, does it really represent something new? In this presentation I will give an overview of IoT, including:</p>\n<p>- What IoT is and is not<br />\n- Terminology<br />\n- Example products<br />\n- Projected growth and market opportunities<br />\n- What does it mean to software developers?<br />\n- Popular hardware platforms<br />\n- Key protocols, hardware technologies, and software frameworks<br />\n- Relevance to Qt<br />\n- Challenges and criticisms (e.g. security and privacy issues)<br />\n- References to learn more</p>\n<p>While this talk will be primarily aimed at developers, it will not be highly technical.</p>\n",
    "session_speaker_name": "Jeff Tranter",
    "session_speaker_company": "Integrated Computer Solutions, Inc.",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/07/Speaker-Jeff-Tranter-ICS-low-res.jpg",
    "session_speaker_bio": "<p>Jeff Tranter is a Qt Consulting Manager at Integrated Computer Solutions (ICS). At ICS, Jeff is responsible for the management of customer software projects, including the architectural and high-level design of software systems. Prior to joining ICS, Jeff was one of the founding members of Xandros Corporation where he managed a team of developers responsible for the desktop components of Linux-based Xandros Desktop products. Jeff has written a number of books on Linux and Open Source programming as well as numerous magazine articles and has given presentations at conferences and user groups.</p>\n"
  },
  "708": {
    "session_id": 708,
    "session_title": "Qt for the Internet of Things, where user experience design meets real-time embedded design",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:30",
    "session_end_time": "17:30",
    "session_room": "a2",
    "session_pdf_title": "Qt for the Internet of Things, where user experience design meets real-time embedded design",
    "session_pdf_url": false,
    "session_abstract": "<p>Modern embedded designs are demanding feature-rich user interfaces, while simultaneously ensuring real-time constraints are met for the most demanding command and control systems at the edge of the Internet of Things (IoT). From the advent of embedded, embedded systems have always lagged behind the desktop environment in user interfaces, but things are changing. What was once rare, is now expected when a user interface is required.</p>\n<p>It not just about the user interface or the embedded system; what matters is the visualization of time-sensitive information that gives the user the ability to visualize data. Further, it is not just about visualization of that data, it is the interpretation of that data which is the key.</p>\n<p>How does a user quickly and accurately maintain the state of an embedded machine, while transporting the data to the cloud, or bringing data down from the cloud and aggregating it so that it allows the user to make quick and informed decisions based on that data? And how does a user accomplish this while maintaining deterministic behavior for real-time tasks, and leveraging the advanced features afforded with Qt on embedded hardware that has an OpenGL® ES capable GPU? This technology bridges the gap between a machine with limited resources and a dedicated function, and the visualization of the data it collects. And it does all of this with a seamless user interface that rivals the desktop environment.</p>\n<p>In this session, we will look at a typical embedded system using the Freescale i.MX6 running Wind River VxWorks real-time operating system, to execute both the rigorous needs of real-time systems coexisting with a smooth and feature-rich user interface. This session is about using Qt in embedded for visualization, organization, status, command and control at the edge of the IoT.</p>\n",
    "session_speaker_name": "Stephen Olsen",
    "session_speaker_company": "Wind River",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Stephen Olsen is a noted embedded industry expert with extensive experience in embedded software development, thought leadership, product management, and communications. Most recently he is a Product Line Manager for VxWorks at Wind River and runs the VxWorks 653 product line along with the user interface and graphics subsystem strategy for VxWorks. Prior to Wind River, Stephen was involved with Mentor Graphics as a consultant, system architect, RTOS engineering manager and their DO178B certification efforts. He also co-chaired VSIA’s Hardware dependent Software (HdS) design working group, worked on the MRAPI specification for the Multi-core Association and authored several papers on system design, USB, multicore/multi-OS design and power management. He was awarded a patent on debugging hardware accelerated operating systems.</p>\n"
  },
  "709": {
    "session_id": 709,
    "session_title": "Introduction to Qt Creator",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:00",
    "session_end_time": "14:00",
    "session_room": "a3",
    "session_pdf_title": "Introduction to Qt Creator",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt Creator is a powerful IDE aimed at making you a more productive C++ and Qt programmer.</p>\n<p>This presentation shows how to use Qt Creator for your Qt development tasks, highlighting classic features as well as the new abilities of Qt Creator 3.4.</p>\n",
    "session_speaker_name": "Tobias Hunger",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Tobias is part of the Qt Tools Team in Berlin, Germany. He got his first Qt Creator patch merged into the 1.3 version and has worked on the code ever since.</p>\n"
  },
  "710": {
    "session_id": 710,
    "session_title": "Getting started with Qt on Android",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:15",
    "session_end_time": "15:15",
    "session_room": "a3",
    "session_pdf_title": "Getting started with Qt on Android",
    "session_pdf_url": false,
    "session_abstract": "<p>In this session the attendees will be learn how to setup the environment, how to use Qt and Qt Creator to target Android devices and how to sign the application in order to prepare them for publishing on Android markets.</p>\n",
    "session_speaker_name": "BogDan Vatra",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>BogDan Vatra is a Software Engineer at KDAB. He has been using Qt since 2002 and is the original author of Qt for Android port.</p>\n"
  },
  "711": {
    "session_id": 711,
    "session_title": "Basic Networking with Qt",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:00",
    "session_end_time": "16:30",
    "session_room": "a3",
    "session_pdf_title": "Basic Networking with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>This talk will introduce you to Qt's networking classes. It will show<br />\nhow you can use TCP and UDP sockets and servers and HTTP with Qt.<br />\nIt will explain how you can architecture a Qt application that is using<br />\nthe network. At the end of the talk we will have created a fully working<br />\nQt application that uses all of this functionality.<br />\n(Danger, live coding!)</p>\n",
    "session_speaker_name": "Markus Goetz",
    "session_speaker_company": "Woboq GmbH",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Already early in his computer life, Markus was interested in distributed systems. It was therefore natural that he worked on the Qt network stack while being a Nokia employee in Oslo. Nowadays Markus works for Woboq in Berlin, helping other companies to use Qt.</p>\n"
  },
  "712": {
    "session_id": 712,
    "session_title": "The 8 mistakes of QtQuick newcomers",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:30",
    "session_end_time": "17:30",
    "session_room": "a3",
    "session_pdf_title": "The 8 mistakes of QtQuick newcomers",
    "session_pdf_url": false,
    "session_abstract": "<p>QtQuick is a declarative language for programming fluid user interfaces and in a short time it has become the de-facto standard for UI programming. It builds on the solid base of Qt and it allows unprecedented speed of prototyping and development.<br />\nThe basis for such speed is to be looked for in the declarative nature of the QML language, a JSON’s superset that also allows Javascript code; the resulting code is easy to grasp, modify and extend. Given these characteristics, many newcomers are productive in just a few days; however, most of them are accustomed to imperative languages, so they have difficulties in completely understanding and embracing the declarative essence of QML and they usually have a hard time in shifting their way of thinking. In my career I’ve seen that some are puzzled by the fuzzy behavior of Javascript, some try to create deep hierarchies of Components that mimic C++ software, a few forget about animations, while others still try to manage memory by hand.<br />\nIn this presentation we will go through the most common pitfalls that newcomers are likely to experience and we’ll see some useful patterns that allow to elegantly deal with them.</p>\n",
    "session_speaker_name": "Luca Ottaviano",
    "session_speaker_company": "Develer Srl",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Luca is a software engineer specialized in the development of user interfaces for embedded systems and has expertise with Qt dates back to version 3.3. His interests range from deeply embedded systems to mobile applications to teaching programming at all levels. In his (definitely not enough) free time Luca is playing with Go and Rust languages.</p>\n"
  },
  "713": {
    "session_id": 713,
    "session_title": "Wearable sensor platforms using Qt in the medical and sports/fitness industry",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:00",
    "session_end_time": "14:00",
    "session_room": "b1",
    "session_pdf_title": "Wearable sensor platforms using Qt in the medical and sports/fitness industry",
    "session_pdf_url": false,
    "session_abstract": "<p>The session will delve into the trends and challenges in building the sensor platforms of tomorrow on the example and development experiences of creating a dedicated high-end optical heart rate and fitness level monitor (PulseOn).</p>\n<p>Qt was used extensively throughout the development cycle of this connected device, and the session will follow all the stages of the PulseOn product development and how Qt was used in them. The session will go into details on how Qt's traditional strengths (cross-platform availability, fast development cycles) were utilized in R&D and product development phases of connected devices in the sports and medical fields like in the case of the PulseOn device. The importance of the use of Qt-friendly analytics in product development will be discussed and how it was used to refine and adapt product development in large deployment scenarios. It will also highlight the technology risks and today's challenges from the aspect of working with devices with very limited resources available to them. </p>\n<p>Finally, a demo of the PulseOn connected device will be shown, and how it was successfully integrated (using Qt) with different host systems, ranging from desktop computers (Linux) through mobile (Android) to embedded (Intel Edison board).</p>\n",
    "session_speaker_name": "Attila Csipa",
    "session_speaker_company": "PulseOn oy",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Attila is the Head of Software at PulseOn, a Finnish company developing high-precision optical heart rate and fitness level monitoring embedded modules and wearables aimed at the sports & fitness market. Prior to that, for several years he was the team lead in Nokia's Developer Experience Technical Consultancy unit where, as part of his duties he evangelized the use of Qt and helped developers develop and improve applications for Qt powered Nokia platforms. In total, he has over ten years of experience developing with Qt across Desktop, Mobile and Embedded device categories.</p>\n"
  },
  "714": {
    "session_id": 714,
    "session_title": "How we stopped using the mouse and started drawing molecules with our fingertips: not the usual porting story",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:30",
    "session_end_time": "14:00",
    "session_room": "b1",
    "session_pdf_title": "How we stopped using the mouse and started drawing molecules with our fingertips: not the usual porting story",
    "session_pdf_url": false,
    "session_abstract": "<p>Porting to mobile a Qt desktop application that lets you draw molecules, crunches numbers, stores data, displays plot and graphs it’s something that goes far beyond converting a QWidget to a Qml component. You have to change user's perspective, merging what they expect from a mobile application with what they expect from a scientific software. You have to<br />\noutsource heavy computational parts and data storage. You have to code from scratch components that don’t exist yet in the Qml ecosystem.</p>\n<p>With the arrival of Qt 5 and the support for Android and iOS, we realized that simply moving our legacy code to the new version of the framework still keeping the QWidget approach wouldn’t be worth it: we needed to port our applications to Qml and open to a whole new set of platforms.</p>\n<p>In this talk you’ll get the lessons learned during a porting journey lasted more than 6 months, with particular reference to the following topics:</p>\n<p>- Rethink a complex user model for drawing molecules so that one can use their fingers on mobile and touch screens, still keeping it usable on a desktop through the mouse<br />\n- Moving heavy computations on the cloud using REST and OAuth2 to exchange data.<br />\n- Provide a theming system for the UI, following Material Design principles but keeping a good user experience on the desktop<br />\n- Refactor graphic and drawing components with a pixel independent approach<br />\n- Develop a brand new interactive 2D plot with Qml in mind</p>\n",
    "session_speaker_name": "Massimiliano Pippi",
    "session_speaker_company": "Self employed",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Massimiliano Pippi has been a software developer for over 10 years, more than half of which he spent working with scientific visualization and backend software for a private company, using C++ and Qt technologies. He is also an open source advocate and active contributor, documentation fanatic, and speaker at conferences. Massimiliano writes about Python and other development-related topics at http://dev.pippi.im.</p>\n"
  },
  "715": {
    "session_id": 715,
    "session_title": "Behavior Driven GUI Testing of Embedded, Mobile and Desktop Qt HMIs",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:15",
    "session_end_time": "15:15",
    "session_room": "b1",
    "session_pdf_title": "Behavior Driven GUI Testing of Embedded, Mobile and Desktop Qt HMIs",
    "session_pdf_url": false,
    "session_abstract": "<p>The quality assurance of software projects with graphical user interfaces, esp. in multi-platform environment such as Qt, often reveals the weaknesses of a development process. </p>\n<p>Did developers and testers work towards a common goal? Does the result satisfy the customer's needs and requirements? How do the different parties communicate in case of disagreement?</p>\n<p>The problem often lies in overwhelming specification documents which developers do not follow. Testers may work totally disconnected from development. And customers only see the end results.</p>\n<p>The Behavior Driven Testing and Development approach attempts to solve this problem. With the established standard language Gherkin, described features and scenarios are understandable for technical and non-technical members. This provides a common language for all involved parties and a single document which serves as specification, documentation and tests - manual or automated.</p>\n<p>The presentation will illustrate this method in detail and show how it can be successfully applied to Qt projects spanning from Desktop to Mobile and Embedded. The focus of the presentation will be the cross-platform Qt GUI test automation of the defined features and scenarios.</p>\n<p>The presentation will concluded with a live demonstration showing how the discussed approach has been successfully used in a real world Qt HMI project.</p>\n",
    "session_speaker_name": "Reginald Stadlbauer",
    "session_speaker_company": "froglogic",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Reginald co-founded froglogic, the creator of the Squish GUI testing tool with special support for automating Qt GUI tests after having worked as Senior Software Engineer at Trolltech, the original makers of Qt. Today Reginald is involved in all aspects of the Squish product as co-CEO of the company.</p>\n"
  },
  "716": {
    "session_id": 716,
    "session_title": "How to Develop with Qt for Multiple Screen Resolutions and Increase &#038; Measure your Cross-Platform App Success (Business Strategy Session)",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:00",
    "session_end_time": "16:30",
    "session_room": "b1",
    "session_pdf_title": "How to Develop with Qt for Multiple Screen Resolutions and Increase &#038; Measure your Cross-Platform App Success (Business Strategy Session)",
    "session_pdf_url": false,
    "session_abstract": "<p>This session shows how to develop applications for multiple screen sizes, screen resolutions and form factors like phones, tablets and desktop PCs with Qt. We show how you can use the same code base, while having native-looking UIs across platforms. This involves tips for responsive design with Qt and a comparison when to use Qt Quick and in which cases C++ is the better choice.</p>\n<p>This talk will also explain which Qt components you can use to increase your application downloads and user retention. And how to measure the success of your apps across platforms.</p>\n<p>This presentation gives you a non-technical overview of the possibilities with Qt for multi-screen development. For an in-depth session with code examples see the technical second part of this presentation in the Qt Application Development & Device Creation Track.</p>\n",
    "session_speaker_name": "Christian Feldbacher",
    "session_speaker_company": "V-Play",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Christian Feldbacher is Co-Founder of V-Play GmbH. He has more than 10 years’ experience in software development with a strong focus on game and mobile app development for all kinds of platforms including native Symbian, Java ME, iOS, Android, MeeGo, and BlackBerry. After 10+ years C++ and 5+ years Qt C++ development, Christian was overwhelmed by Qt Quick and the combination of performance and code efficiency. His passion for games and experience in Qt, game, and mobile platform development led to the creation of V-Play Game Engine which was publicly launched in January 2013. Besides working on V-Play, Christian joins game jams and teaches university students how to develop with Qt. Previous Presentation Experience: Christian held a 1-hour session about cross-platform app development at Qt Developer Days Europe 2014 and gave a lightning talk at 2013’s Qt Developer Days in Berlin, where he won the “Most Innovative Talk” award. Christian has started to work as a tutor for programming and mathematics during his Bachelors and Master’s degree and presented complex topics on a weekly regular basis. After finishing the Mobile Computing Master program, he started to work as a lecturer on the University of Applied Sciences Hagenberg, teaching Bachelor and Master students cross-platform development with Qt.  Besides presentations for students as a teacher, he often speaks on big public events. Examples are Global Game Jam Austria, Knowledge Night about Cross-Platform Development or Game Stage in Ars Electronica Center. As Co-Founder of V-Play, he also presents V-Play on conferences and Startup competitions on a regular basis, like at Game Developers Conference in Cologne or a recent talk at Microsoft Headquarter in Austria about cross-platform development with Qt.</p>\n"
  },
  "717": {
    "session_id": 717,
    "session_title": "Effective multi-platform development with Qt Creator, QBS, and QEMU",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:30",
    "session_end_time": "17:00",
    "session_room": "b1",
    "session_pdf_title": "Effective multi-platform development with Qt Creator, QBS, and QEMU",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt solves the most important challenge of cross-platform development by giving you a toolkit for running your application across multiple devices and operating systems. It doesn't dictate what platform or configuration to use for development, allowing you to freely choose which environment to work in. Some target platforms just aren't that forgiving, though, prompting the development team to invest in multiple PCs and additional hardware - even additional developers - to cover all corners of the device market. These added environments and context switches can cut into your efficiency and your bottom line.</p>\n<p>By leveraging Linux as the core of your development environment, you can extend your cross-platform effectiveness by reducing the burden of platform context switches. Utilizing the best IDE for the job (Qt Creator), a fast and coherent build system (QBS), and world-class virtualization (QEMU), the task of building for multiple targets can be simplified. Linux allows for a free and configurable base for getting the most out of your hardware when building and deploying inside virtualized, scriptable environments with QEMU. The Qt Build Suite (QBS) improves compilation times while greatly improving the developer experience associated with the tedium of managing large dependency trees and different toolchains and SDKs. Qt Creator gives you the optimal development environment for which to write your code, along with superior deployment and debugging tools. All of this under any window manager of your choice!</p>\n<p>This talk presents a foundation for combining different open source technologies to improve your effectiveness in authoring and deploying cross-platform. Have you ever been curious about building and deploying Windows or OS X applications under Linux? Perhaps you've wanted to port your large application to QBS, but just need the push to see how painless it really is? The goal of this talk is to encourage you to consider developer experience in your everyday workflow in order to think differently about how to manage your development and get the job done. It highlights the pain points of the native build process and gives cues to finding improving efficiency and developer happiness through FOSS tools and Qt.</p>\n",
    "session_speaker_name": "Andrew Knight",
    "session_speaker_company": "Intopalo",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Andrew Knight is an experienced developer and Qt contributor who has a passion for improving his understanding through better software practice. He works as a dedicated cross-platform consultant and Qt super-user, leveraging the awesome powers of open source (and giving back when he can). He especially enjoys complex challenges, clean code, and sharp tools. Andrew is the platform maintainer of Qt for Windows Runtime and actively dabbles within other areas of the Qt framework.</p>\n"
  },
  "718": {
    "session_id": 718,
    "session_title": "Qt in IoT context : connected alarm-clock",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "17:00",
    "session_end_time": "17:30",
    "session_room": "b1",
    "session_pdf_title": "Qt in IoT context : connected alarm-clock",
    "session_pdf_url": false,
    "session_abstract": "<p>This presentation aims at offering a Qt application connected to the Cloud on an embedded device, while highlighting some of Qt5 major  features (OpenGL acceleration, multitouch areas, shader effects…).<br />\nThis project highlights the following points:<br />\n-\tWebservices for getting weather, news, time, and other useful information as you wake<br />\n-\tCommunication with a WIFI bulb light for simulating a slowly rising light with a dedicated color<br />\nA live demo on an iMX6 embedded system will demonstrate the connected Qt alarm-clock.</p>\n",
    "session_speaker_name": "Adrien Leravat",
    "session_speaker_company": "Adeneo Embedded",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Adrien Leravat is a senior embedded software consultant in Qt Technologies at Adeneo Embedded since 2012. He is daily focused on projects using Qt, on native application development projects or QtQuick projects, on Linux Embedded, Windows Embedded and mobile platforms. Adrien is also a Qt trainer for different Qt trainings offered by Adeneo Embedded. The artistic talent of Adrien helps him to create rich and ergonomic graphical user interfaces. Adrien is activated on the Qt community via newsgroups and forums. Adrien is graduated in Engineering in Computer Science.</p>\n"
  },
  "719": {
    "session_id": 719,
    "session_title": "How Qt Meets the Automotive Technology Requirements of Today, Tomorrow &#038; Beyond",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:00",
    "session_end_time": "13:30",
    "session_room": "b2",
    "session_pdf_title": "How Qt Meets the Automotive Technology Requirements of Today, Tomorrow &#038; Beyond",
    "session_pdf_url": false,
    "session_abstract": "<p>Users expect a seamless customer experience between all their devices and services, even within the car. Qt powers multiple automotive infotainment systems and smart car dashboards. To bring content inside the car, Qt can be used as a full platform for software services and applications running on top of the car's operating system.</p>\n<p>Through Qt’s cross-platform functionality, the same services can be extended beyond the car’s own displays and into the passenger devices (BYOD). Qt’s features let you create premium entertainment solutions and modern in-vehicle user experiences requested by today’s demanding automotive customer. What’s more, Qt’s flexible architecture allows for manufacturers to adapt to the market’s quickly changing requirements and easily be able to comply with future specifications.  </p>\n<p>In this talk, we will discuss the automotive industry trends from a technology provider’s point of view: what are the challenges and how can we address them with Qt? What sort of user expectations are there towards modern automotive UX and applications and how to create an ecosystem using one technology.</p>\n<p>In essence, we will walk you through the Qt offering for automotive system creation, give you an overview of Qt as a platform with applications, tool chains and ecosystem creation possibilities and present our roadmap and partnerships around automotive.</p>\n",
    "session_speaker_name": "Petteri Holländer",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Petteri Holländer is the Head of Product Management at The Qt Company. He has been with the software industry for 20 years, in different positions from Technology Consultant to CTO, from Product Group Manager to Head of Business Development.</p>\n"
  },
  "720": {
    "session_id": 720,
    "session_title": "Automotive Session 6 (to be announced)",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "13:30",
    "session_end_time": "14:00",
    "session_room": "b2",
    "session_pdf_title": "Automotive Session 6 (to be announced)",
    "session_pdf_url": false,
    "session_abstract": "<p>Stay tuned</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "722": {
    "session_id": 722,
    "session_title": "Automotive Session 7 (to be announced)",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:45",
    "session_end_time": "15:15",
    "session_room": "b2",
    "session_pdf_title": "Automotive Session 7 (to be announced)",
    "session_pdf_url": false,
    "session_abstract": "<p>Stay tuned</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "723": {
    "session_id": 723,
    "session_title": "Revolutionizing Automotive with Qt",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "14:15",
    "session_end_time": "15:15",
    "session_room": "b2",
    "session_pdf_title": "Revolutionizing Automotive with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>The user interfaces in cars is undergoing a dramatical change right now. Touch screens, applications and beautiful, modern user interfaces are coming to a car close to you. For Qt, this is a perfect fit, but not without challenges. Automotive systems commonly consists of multiple displays, legacy technology, focus on hardware costs as well as legally controlled start-up times, long product cycles and more. Solving these issues with Qt means revolutionizing what you can expect from your next car - but also they way that automotive software is created.</p>\n",
    "session_speaker_name": "Johan Thelin",
    "session_speaker_company": "Pelagicore",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Johan Thelin has worked with Qt for more than 15 years and used it in desktop settings as well as embedded deployments in various industries. He has authored numerous articles on Qt, as well as the Foundations in Qt Development book from Apress and has co-authored www.qmlbook.org. The last five years he has worked with Pelagicore creating an automotive Linux platform built around Qt.</p>\n"
  },
  "725": {
    "session_id": 725,
    "session_title": "&#8211; In the Driver&#8217;s Seat &#8211; Tech Tales from the Automotive Sector",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:00",
    "session_end_time": "16:30",
    "session_room": "b2",
    "session_pdf_title": "&#8211; In the Driver&#8217;s Seat &#8211; Tech Tales from the Automotive Sector",
    "session_pdf_url": false,
    "session_abstract": "<p>Coming soon</p>\n",
    "session_speaker_name": "Louai Al-Khanji",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Coming soon</p>\n"
  },
  "726": {
    "session_id": 726,
    "session_title": "How to Implement an Automotive Infotainment System using Qt Quick",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "16:30",
    "session_end_time": "17:00",
    "session_room": "b2",
    "session_pdf_title": "How to Implement an Automotive Infotainment System using Qt Quick",
    "session_pdf_url": false,
    "session_abstract": "<p>Demand for connected devices in automobiles is accelerating as mobile ecosystems are maturing. The ability for automakers to differentiate in an increasingly competitive environment depends on its ability to integrate a smart in-vehicle infotainment (IVI) system strategy and deliver a fully connected lifestyle to consumers. The manufacturers who succeed at providing an open, scalable and easily configurable automotive IVI will be the future market leaders.</p>\n<p>Consumers expect the same user experience (UX) in their automobiles as on other personal devices that blend beauty and simplicity with practical use and technology. These increased expectations for design and performance also add complexities in interoperability and safety for the automaker.</p>\n<p>This talk describes the architecture and design of an IVI system written using the Qt(R)/Qt Quick framework running on the Intel(R) In-Vehicle Solutions compute module.  This application features:</p>\n<p>- A set of C++ classes including all IVI features that can be integrated with vastly different IVI visual designs,<br />\n- The ability to test all IVI functionality in isolation without any IVI,<br />\n- A set of loosely coupled native applications that can be plugged into the IVI system,<br />\n- The ability to deliver new applications without needing to modify, recompile or relink any existing IVI code,<br />\n- Easy customization of IVI application assets (graphics and colors) without needing to modify the IVI code,<br />\n- The ability for IVI to be translated and localized for worldwide deployment,<br />\n- Seamless integration with third-party supplied IVI functionality,<br />\n- Delivery of < 2 second start-up time and velvet smooth run time performance</p>\n<p>In particular, key architectural components will be covered:<br />\n- Layered Design<br />\n- Plug-in Architecture<br />\n- Surface Composition<br />\n- User Interface Templates<br />\n- Asset Management<br />\n- Make and Model Customization<br />\n- Screen Orientation<br />\n- Internationalization</p>\n<p>Any IVI system must run on specialized hardware and provide a responsive user experience while doing a variety of simultaneous tasks. Hardware displays range from small non-touch displays with hardwired buttons to large touch-sensitive screens. Vehicle manufacturers seek a global solution they can deploy across their entire product line which may feature different capabilities depending upon the model.  This also may mean different brands or styles.  In addition, their vehicles are sold worldwide and their IVI systems must support local languages and units.  Can all of this be done with one software platform? This presentation argues, yes!</p>\n<p>While the example used is an Automotive Infotainment System the concepts apply equally well to any application that requires on-the-fly color themes, user selectable localization, and run time selection of application functionality.</p>\n",
    "session_speaker_name": "Dustin Kassman",
    "session_speaker_company": "Integrated Computer Solutions, Inc.",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Dustin Kassman has been a technical project manager at Integrated Computer Solutions, Inc. (ICS) for over 9 years. With degrees in both software engineering and business administration, he easily straddles the line between customers and the development team, often taking the role of customer advocate. Dustin also takes great pride in the quality work done by ICS engineers. Prior to ICS, he spent 24 years at Hewlett-Packard as a software development engineer.</p>\n"
  },
  "727": {
    "session_id": 727,
    "session_title": "Resolving Automotive UI Challenges With an Optimized Qt Implementation",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "17:00",
    "session_end_time": "17:30",
    "session_room": "b2",
    "session_pdf_title": "Resolving Automotive UI Challenges With an Optimized Qt Implementation",
    "session_pdf_url": false,
    "session_abstract": "<p>Diversity is the name of the game in today’s automotive development. In-car systems make use of UI technologies such as Qt, HTML5 and OpenGL. They incorporate frameworks from companies such as Crank Software, DiSTI Corporation, Elektrobit, HI Corporation, Rightware and 3D Incorporated, just to name a few. Infotainment systems are now also supporting projection mode technologies such as MirrorLink, Apple’s CarPlay and Google’s Android Auto. As the premier software supplier in the infotainment market with >50% market share (IHS Automotive, 2014), QNX Software Systems has extensive experience with all of these technologies, and all are supported on the QNX OS – but for a native HMI, QNX has selected and optimized Qt, and fully integrated it into the QNX CAR Platform for Infotainment. In this session, we will look at QNX’s work with Qt, system and development challenges in automotive, and the future of Qt as it is increasingly embraced by automakers and Tier 1 suppliers worldwide.</p>\n",
    "session_speaker_name": "Grant Courville",
    "session_speaker_company": "QNX Software Systems",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/07/Speaker-Grant-Courville-low-res.jpg",
    "session_speaker_bio": "<p>As director of product management at QNX Software Systems, Grant Courville is responsible for managing the company’s global product strategy for the automotive and general embedded markets. He has more than 25 years of experience in the embedded industry, including 20 years with QNX in a wide range of roles, from software development to leadership positions in marketing, professional services, sales, and marketing. Grant’s QNX experience is complemented by senior roles with Curtiss-Wright Controls and Tilcon Software. His education includes programs at Queen’s University, MIT, and St. Lawrence College.</p>\n"
  },
  "728": {
    "session_id": 728,
    "session_title": "Qt Canvas3D &#8211; Presenting the Pipeline",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "10:00",
    "session_room": "a1",
    "session_pdf_title": "Qt Canvas3D &#8211; Presenting the Pipeline",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt Canvas3D 1.0 was introduced as an official Qt module in Qt 5.5, after technology preview release with Qt 5.4. Canvas3D implements a WebGL-like API. It enables users to run 3D content implemented with WebGL based libraries and tooling pipelines directly inside QML JavaScript without requiring a HTML runtime to be present. It also enables sharing the 3D content including the models, textures, and JavaScript code between a HTML page and a native application.</p>\n<p>This talk will first introduce the new developments to Canvas3D we have coming in Qt 5.6. We have continued optimizing and further integrating Canvas3D with the Qt Quick scene graph renderer. This includes a rewrite of Canvas3D to move the OpenGL rendering calls to the scene graph render thread. This will enable better performance in multithreaded rendering environments and allow rendering of QML elements into textures that can then be used with the Canvas3D's rendering API.</p>\n<p>The session will also include a hands-on part that demonstrates how easy it is to get started with Canvas3D when combining it with a library like three.js that has been already ported to run on top of Canvas3D. The session shows the basics. Starting from how you can get the correct version of three.js, how to integrate the library with Canvas3D in your QML and JavaScript code, how to load 3D models in to your scene, how to load textures, how to build a scene with 3D objects, and how simple it is to start combining the 3D elements in the scene with QML state transition and animation.</p>\n",
    "session_speaker_name": "Pasi Keränen",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Pasi Keränen has been working with 3D related software since 1990's from applications running on top of OpenGL, optimisation of mobile UI frameworks to run on top of hardware accelerated graphics, down to working as architect and technology owner in mobile graphics adaptation area. Pasi has participated Khronos Group standardization (EGL 1.4, OpenKODE 1.0) and chaired the Khronos OpenWF API working group between 2008 and 2009. Today he works at Digia Finland as Software Specialist in the Qt Research & Development organisation on graphics technology related matters.</p>\n"
  },
  "729": {
    "session_id": 729,
    "session_title": "Effective Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:10",
    "session_end_time": "11:10",
    "session_room": "a1",
    "session_pdf_title": "Effective Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>For around two decades now, Scott Meyers' Effective C++ series forms an indispensable resource for even the most experienced C++ developer, and many of us own a copy. Its bite-sized items allow you to read one small chapter at a time, and return to your work, applying what you just learned right away.</p>\n<p>What was lacking was a similar resource for Qt development.</p>\n<p>In 2010, Marc Mutz started a series of blog posts under the series title Effective Qt (https://marcmutz.wordpress.com/effective-qt/), which, however, fell prey to paternity in 2012. It still generates a lot of traffic, so there continues to be demand for it.</p>\n<p>These blog-posts described the state as of Qt 4, while this session will target Qt 5, introducing new guidelines and updating existing advice on such varied topics as API design, performance, and code quality.</p>\n<p>Among other things, you will learn how to get the most out of the new QObject signal/slot connection syntax, and how to blaze a trail through the surprising complexity of QString creation.</p>\n<p>Participants are expected to have a working knowledge of Qt (specifically, QtCore).</p>\n",
    "session_speaker_name": "Marc Mutz",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Marc Mutz is a Senior Software Engineer, Trainer, and Consultant with KDAB – The Qt Experts. Starting out around the turn of the century as a KMail/Kontact Core Developer, he has since wandered down the software stack to become a major contributor to the Qt Project, and maintainer of its QtWidgets module.</p>\n<p>Having taught more than 25 multi-day Qt trainings to companies such as Schlumberger, EADS and Siemens, he was also among the first batch of Qt developers certified by Nokia’s now-defunct Qt certification programme in 2009.</p>\n<p>Marc is recently enjoying his new role as parent and—increasingly less so—as a house builder.</p>\n"
  },
  "730": {
    "session_id": 730,
    "session_title": "Using the Qt Quick Scene Graph API",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "11:30",
    "session_end_time": "12:30",
    "session_room": "a1",
    "session_pdf_title": "Using the Qt Quick Scene Graph API",
    "session_pdf_url": false,
    "session_abstract": "<p>The scene graph is the main change under the hood of QtQuick 2 that justified a new major version of the technology, while the rest initially remained similar to QtQuick 1. The extra performance is provided automatically for applications to enable smooth panning and scaling, but there are some situations where you can take advantage of using the scene graph API directly to smoothen your custom graphical item animations.</p>\n<p>This talk will present how the lower-level scene graph API in QtQuick can, with the help of a few lines of C++ code, allow you to reduce the overhead of QML abstractions and offload some transform computations to the GPU. In addition this will present:</p>\n<p>- What the scene graph is and how it relates to a QML component or QQuickItem.<br />\n- How it is different from a QGraphicsScene.<br />\n- How it interacts with OpenGL and the GPU.<br />\n- How you can write code to run safely in the render thread and taking advantage of the geometry batching done by the renderer.<br />\n- What APIs like QQuickItem::updatePaintNode, QSGNode, QSGGeometry, QSGMaterial and QSGTexture are used for.</p>\n",
    "session_speaker_name": "Jocelyn Turcotte",
    "session_speaker_company": "Woboq GmbH",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Jocelyn is a Software Engineer at Woboq GmbH. He has been working on Qt since 2009, first on QtWebKit at Nokia and then on QtWebEngine at Digia/The Qt Company. Among other things, he took care of the integration of both QtWebKit and QtWebEngine into QtQuick 2 using the scene graph, working on getting the tightest performances on all platforms. He is a fan of networks, graphics and finely threaded code. He also enjoys working with a mixture of chewed cookies and coffee in his stomach.</p>\n"
  },
  "731": {
    "session_id": 731,
    "session_title": "How to Develop with Qt for Multiple Screen Resolutions and Increase &#038; Measure your Cross-Platform App Success (In-Depth Tech Session)",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "13:30",
    "session_end_time": "14:30",
    "session_room": "a1",
    "session_pdf_title": "How to Develop with Qt for Multiple Screen Resolutions and Increase &#038; Measure your Cross-Platform App Success (In-Depth Tech Session)",
    "session_pdf_url": false,
    "session_abstract": "<p>This session shows how to develop applications for multiple screen sizes, screen resolutions and form factors like phones, tablets and desktop PCs with Qt. We show how you can use the same code base, while having native-looking UIs across platforms. This involves tips for responsive design with Qt and a comparison when to use Qt Quick and in which cases C++ is the better choice.</p>\n<p>We cover dynamic image switching, content scaling and basic Qt Quick features like file selectors, Loader elements, Layouts, QML Singletons and property bindings and compare the use cases for each of them. In addition, we introduce a density-independent approach you can use to create Qt apps on different resolutions and screen densities.</p>\n<p>This talk also explains which Qt components you can use to increase your application downloads and user retention. And how to measure the success of your apps across platforms.</p>\n<p>This presentation gives you a technical overview with code snippets and hands-on examples of the possibilities with Qt for multi-screen development. For a non-technical overview of this topic, we recommend the first part of this presentation in the Qt Technology Strategy Track.</p>\n",
    "session_speaker_name": "Christian Feldbacher",
    "session_speaker_company": "V-Play",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Christian Feldbacher is Co-Founder of V-Play GmbH. He has more than 10 years’ experience in software development with a strong focus on game and mobile app development for all kinds of platforms including native Symbian, Java ME, iOS, Android, MeeGo, and BlackBerry. After 10+ years C++ and 5+ years Qt C++ development, Christian was overwhelmed by Qt Quick and the combination of performance and code efficiency. His passion for games and experience in Qt, game, and mobile platform development led to the creation of V-Play Game Engine which was publicly launched in January 2013. Besides working on V-Play, Christian joins game jams and teaches university students how to develop with Qt. Previous Presentation Experience: Christian held a 1-hour session about cross-platform app development at Qt Developer Days Europe 2014 and gave a lightning talk at 2013’s Qt Developer Days in Berlin, where he won the “Most Innovative Talk” award. Christian has started to work as a tutor for programming and mathematics during his Bachelors and Master’s degree and presented complex topics on a weekly regular basis. After finishing the Mobile Computing Master program, he started to work as a lecturer on the University of Applied Sciences Hagenberg, teaching Bachelor and Master students cross-platform development with Qt.  Besides presentations for students as a teacher, he often speaks on big public events. Examples are Global Game Jam Austria, Knowledge Night about Cross-Platform Development or Game Stage in Ars Electronica Center. As Co-Founder of V-Play, he also presents V-Play on conferences and Startup competitions on a regular basis, like at Game Developers Conference in Cologne or a recent talk at Microsoft Headquarter in Austria about cross-platform development with Qt.</p>\n"
  },
  "732": {
    "session_id": 732,
    "session_title": "Optimizing Qt Applications",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "14:30",
    "session_end_time": "15:00",
    "session_room": "a1",
    "session_pdf_title": "Optimizing Qt Applications",
    "session_pdf_url": false,
    "session_abstract": "<p>The Qt libraries are highly versatile and offer a nice API for writing applications with. From simple graphical interfaces to complex client/server architectures, Qt offers the tools to get the job done.</p>\n<p>But, just like with any other abstraction, it is sometimes not straightforward what will happen behind the scenes. This can have detrimental effects on the performance of your application, when seemingly innocent code wreaks havoc on your cache lines, hardware threads are starved and the graphical interface freezes.</p>\n<p>This talk will look at such situations, shows you how to analyze the hotspots and presents solutions to some common performance pitfalls in Qt code.</p>\n",
    "session_speaker_name": "Milian Wolff",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Tooling and profiling became Milian's hobby over the last seven years while working on KDE applications such as KDevelop and Kate. While working at KDAB he created the Massif-Visualizer and, more recently, heaptrack, both of which are now used regularly to improve the performance of C++ applications in general, and Qt applications in particular. Since finishing his studies in Physics with a Masters degree, he now applies this knowledge to improve the performance of KDAB customers code bases.</p>\n"
  },
  "733": {
    "session_id": 733,
    "session_title": "When all goes according to script",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "15:30",
    "session_end_time": "16:30",
    "session_room": "a1",
    "session_pdf_title": "When all goes according to script",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt has had in-application scripting capabilities for a long time in the form of the QtScript module.</p>\n<p>With the deprecation of said module in Qt5.5, many have started looking for a successor.<br />\nQJSEngine and, by extension, its variant QQmlEngine, mostly famous for being at the core of Qt's outstanding QML technology, are the most obvious candidates.</p>\n<p>While neither is a drop-in replacement of the now deprecated QtScriptEngine, they do provide a state-of-the-art JavaScript implementation, with a wide range of easy to use integration points.</p>\n<p>Being explicitly designed for use with Qt and its object and introspection system does not only allow them to easily and efficiently bridge between the C++ and JavaScript worlds, it also puts them into a special position when it comes to supported platforms.</p>\n<p>While other engines, like Google's famous V8, cannot be used on platforms with certain restrictions, such as Apple's iOS, Qt's new engine, lovingly code-named V4, remains fully portable and supported as these restrictions have been part of all design and implementation considerations.</p>\n<p>This talk will focus on how to use these new facilities and common techniques for integrating with the application's data and functionality.<br />\nSpecial attentions will be drawn to how the capabilities inherent to the QML variant can make scripts even more versatile, elevating them from mere execution and computation helpers to powerful application add-ons.</p>\n<p>While QML is most well known for being the foundation for QtQuick based user interfaces,<br />\nit offers great opportunities for scripts in applications using QtWidgets, or not having any UI at all.</p>\n",
    "session_speaker_name": "Kevin Krammer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Kevin has been developing with Qt since its early versions, both as a professional software engineer as well as a contributor to Qt based Free and Open Source Software communities. He's currently a senior software engineer and Qt trainer at KDAB, a developer and mentor at KDE and a top ten contributor, moderator and administrator on the Qt community forum QtCentre.org. He's also know bringing fine Austrian chocolate to whereever he goes and preparing feasts for his friends.</p>\n"
  },
  "734": {
    "session_id": 734,
    "session_title": "Writing better code with help from Qt and the compiler",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "10:00",
    "session_room": "a2",
    "session_pdf_title": "Writing better code with help from Qt and the compiler",
    "session_pdf_url": false,
    "session_abstract": "<p>Traditionally, getting the most out of a processor required writing assembly code that used specialised instructions to accomplish some particular tasks. And though that's still widely used, processors are very complex and maintaining assembly code by hand is a hard and tedious task. Add to that the fact that processors evolve and getting the timings right of each generation is better left to the compiler.</p>\n<p>A little known feature of the compilers is that it is possible to get access to certain instructions from high-level C and C++ code, by way of intrinsic functions, thus allowing developers of native code to get very close to bare metal performance. Yet modern compilers can offer more functionality to help the bold developer write better code. For example, GCC can offer an automatic way of dispatching to different functions based on the architecture the code is being run on. Both GCC and the Intel compiler also allow code for multiple targets to be written in one single C or C++ source file, thereby allowing for better optimisation by way of inlines and dead code elimination.</p>\n<p>All is well and good if you know exactly which compiler you're using. When one has to deal with multiple compilers, like Qt routinely has to, things may get tricky. If the objective is to write optimal code for important, hot code paths, we don't want to settle for \"lowest common denominator\" of compiler support. To make sure we don't fall into that trap, Qt has a series of macros and both compile- and run-time processor feature detection support to generate the best code given the environment in use. </p>\n<p>This presentation will present those techniques and show which ones work on GCC, Clang, the Intel compiler and Microsoft Visual Studio. It will also show how to get more information on which intrinsics exist and what they do. It will draw heavily upon the presenter's experience implementing this very type of optimisations for Qt 5.3 and 5.3.</p>\n",
    "session_speaker_name": "Thiago Macieira",
    "session_speaker_company": "Intel",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Thiago Macieira holds a double degree in Engineering and an MBA. He has been involved in several Open Source projects for over 15 years and is an experienced C++ developer, having spent the better part of the last 10 years developing Qt and Qt-based software. He was also behind the creation of the Qt Project, an open source project around the Qt codebase. He works for Intel’s Open Source Technology Center (OTC) and he collects too many air miles going to conferences speaking about Qt, C++ and Open Source.</p>\n"
  },
  "735": {
    "session_id": 735,
    "session_title": "Qt for Native Client",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:10",
    "session_end_time": "11:10",
    "session_room": "a2",
    "session_pdf_title": "Qt for Native Client",
    "session_pdf_url": false,
    "session_abstract": "<p>Native Client is a sandbox for running compiled C++ code securely and efficiently in the Chrome browser. The Qt for Native Client platform port allows compiling Qt applications as Portable Native Client executables, which can then be distributed via the web or on the Chrome App store to any system running the Chrome browser or Chrome OS.</p>\n<p>This talk will show how to use NaCl SDK and tools provided with Qt to create, debug, and deploy a web-distributable application using either Qt Widgets or Qt Quick. A key aspect will be highlighting the unique requirements and restrictions caused by the Native Client and browser sandboxes. Topics covered includes interaction with the hosting web page, OpenGL, Multimedia, network access and the Qt Quick runtime and playground.</p>\n<p>Qt for Native Client is available as a tech preview in source code form.</p>\n",
    "session_speaker_name": "Morten Johan Sørvig",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Morten has 10 years of experience as a Qt developer. Today he functions as a platform plumber working on the Qt platform layer.</p>\n"
  },
  "736": {
    "session_id": 736,
    "session_title": "Extending Qt on Android apps using JNI",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "11:30",
    "session_end_time": "12:30",
    "session_room": "a2",
    "session_pdf_title": "Extending Qt on Android apps using JNI",
    "session_pdf_url": false,
    "session_abstract": "<p>Why? Because it is impossible for Qt to implement all Android features e.g.:</p>\n<p> * listening for Android O.S. notifications:<br />\n    **   sd card notifications: bad removal, eject, mounted, unmounted, etc.<br />\n    **   network notifications: network up/down.<br />\n    **   battery level and charging state.<br />\n    **   etc.<br />\n * accessing Android O.S. features:<br />\n    **  telephony (Initiate calls, MMS, SMS, etc.)<br />\n    **  contacts<br />\n    **  speech (TTS and Speech Recognizer)<br />\n    **  system accounts<br />\n    **  system preferences<br />\n    **  NFC<br />\n    **  USB<br />\n    **  OBB</p>\n<p> * create own Android Activities and Services.</p>\n<p>The audience will learn how to extend their qt apps using JNI to access any Android features that are not available on Qt. </p>\n<p>Previous knowledge about Qt, threads & Android API is needed.</p>\n",
    "session_speaker_name": "BogDan Vatra",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>BogDan Vatra is a Software Engineer at KDAB. He has been using Qt since 2002 and is the original author of Qt for Android port.</p>\n"
  },
  "737": {
    "session_id": 737,
    "session_title": "Virtual Keyboards for Qt applications",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "13:30",
    "session_end_time": "14:30",
    "session_room": "a2",
    "session_pdf_title": "Virtual Keyboards for Qt applications",
    "session_pdf_url": false,
    "session_abstract": "<p>With touch screen devices gaining more and more popularity, there is the increasing need  to support text input via virtual keyboards.</p>\n<p>In this session we will explore different requirements for virtual keyboards and we will have a look at different options to integrate a virtual keyboard into Qt Widgets and Qt QML applications depending on these requirements with the Qt Platform Abstraction API for different platforms like eglfs, X and Wayland.</p>\n<p>We will have a look at some existent virtual keyboards like the Qt Virtual Keyboard and some Qt open source solutions. We will also see how a custom virtual keyboard could be created from scratch.</p>\n<p>We will look at some advanced features of virtual keyboards like support for different layouts, support for text correction and prediction and support for multiple languages especially CJK languages. </p>\n<p>We will see how the Qt input method API can be used on application side to improve the user experience with virtual keyboards.</p>\n",
    "session_speaker_name": "Tobias König ",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Tobias is a Software Engineer at KDAB. He has actively developed with Qt since 2001 and has been an active KDE contributor for the same time. His contributions have been mainly to the KDE PIM project and the KDE libraries, but also to other open source projects. Tobias is also a Qt trainer.</p>\n"
  },
  "738": {
    "session_id": 738,
    "session_title": "Contributing your first patch to the Qt Project",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "14:30",
    "session_end_time": "15:00",
    "session_room": "a2",
    "session_pdf_title": "Contributing your first patch to the Qt Project",
    "session_pdf_url": false,
    "session_abstract": "<p>The Qt Project has been up and running for over three years now and has released Qt from 4.8 through 5.3 with a community of developers interested in making Qt a better product. That was not an accident. So how does one join in \"the fun\"? New contributors to Qt will want to know what the requirements are for the first patch they submit, like how to format it properly, what they should and should not modify in the source code, what the coding style is, how to nurse it through acceptance in the Qt Project infrastructure, etc.</p>\n<p>Full Abstract:</p>\n<p>Joining an established team of developers can be a daunting task for a lot of reasons, ranging from unfamiliarity with the code itself, through ignorance of existing practices, to difficulty fitting in with the personalities. It gets more difficult when we're talking about an Open Source Project, with contributors all over the world, few of whom are native English speakers.</p>\n<p>Those are not showstoppers, though. Not for the Qt Project: created to drive the development of Qt and other related projects, we strive to make it easier for newcomers to participate (this presentation being one such way). In this session, we will try to address issues like:</p>\n<p>   * overview of the Qt Project and decision-making<br />\n   * how to obtain the Qt source code in a form suitable for modification (i.e., \"cloning from Git\")<br />\n   * the Qt coding style and library coding policies<br />\n   * making changes to Qt and testing them<br />\n   * dealing with cross-platform issues and what one really needs to know<br />\n   * submitting to the Qt code review system and reviewing with other developers (\"pushing to Gerrit\")<br />\n   * submitting the change through Qt's Continuous Integration system<br />\n   * API reviews, timelines, roadmaps</p>\n<p>There will be ample time at the end of the presentation for questions and discussions.</p>\n",
    "session_speaker_name": "Thiago Macieira",
    "session_speaker_company": "Intel",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Thiago Macieira holds a double degree in Engineering and an MBA. He has been involved in several Open Source projects for over 15 years and is an experienced C++ developer, having spent the better part of the last 10 years developing Qt and Qt-based software. He was also behind the creation of the Qt Project, an open source project around the Qt codebase. He works for Intel’s Open Source Technology Center (OTC) and he collects too many air miles going to conferences speaking about Qt, C++ and Open Source.</p>\n"
  },
  "739": {
    "session_id": 739,
    "session_title": "Using namespace std;",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "15:30",
    "session_end_time": "16:30",
    "session_room": "a2",
    "session_pdf_title": "Using namespace std;",
    "session_pdf_url": false,
    "session_abstract": "<p>There is some overlap between features provided by Qt and those provided by the C++ standard library (classes in the std namespace). Some Qt developers are even a little afraid of using the standard library, while some others are criticizing Qt for not playing well with the standard. In this talk we will see the differences and similarities between Qt and the standard library, and how they complement each other. We will look at how to make better use of the standard library in your Qt application. It is a technical talk in which you will learn both about the Qt core classes and standard classes.</p>\n",
    "session_speaker_name": "Olivier Goffart",
    "session_speaker_company": "Woboq GmbH",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Olivier Goffart started working with Qt 10 years ago with his involvement in KDE. He was then hired by Trolltech to work on Qt in 2007. He has been working on various areas of Qt including the itemview framework, the widget stylesheets, QtScript, the QObject internals, and the QML debugger for Creator. He is now the co-founder of Woboq, a company based in Berlin focusing on Qt.</p>\n"
  },
  "740": {
    "session_id": 740,
    "session_title": "Developing for Windows 10 With Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "10:00",
    "session_room": "a3",
    "session_pdf_title": "Developing for Windows 10 With Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>This is part 2 of Windows 10 related submissions and will go into technical details.</p>\n<p>Windows 10 has been released in summer 2015 and Qt welcomes this new version by providing full support for it. </p>\n<p>However, some considerations might be needed to get the most out of your project and get started developing for Windows 10.</p>\n<p>This talk will give a detailed overview of getting started with Qt and Windows 10. A project will be compiled, deployed and run on desktop, mobile as well as Windows 10 IoT Core (most likely Raspberry Pi2).</p>\n<p>Following that a couple of descriptions for Windows 10 related packaging will be presented. How does the sandboxing look like on Windows 10? What are Universal Binaries and what kind of support does Qt provide for them. Also all steps required for publishing to the Windows Store will be explained.</p>\n<p>The last section talks about moving existing projects to Windows 10, first running on desktop and then later on embedded. A couple of options and parameters might be required to successfully launch the project under the new environment. In some cases such a “port” from one Windows version to another might not even be required. The pros and cons will be presented as well too.</p>\n",
    "session_speaker_name": "Maurice Kalinowski",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Maurice Kalinowski works for the Qt Company as Senior R&D Manager, Tools and Framework. He started at Trolltech GmbH in Germany in 2006, working on the initial Windows CE 5 port. Following that he worked on multiple areas in regards to developer offering in Nokia: Qt Simulator, Qt Installer Framework, and (Nokia) Qt SDK. </p>\n"
  },
  "741": {
    "session_id": 741,
    "session_title": "Qt on iOS A to Z",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:10",
    "session_end_time": "11:10",
    "session_room": "a3",
    "session_pdf_title": "Qt on iOS A to Z",
    "session_pdf_url": false,
    "session_abstract": "<p>Since version 5.2, Qt has been available on iOS. In this talk, we go through the process of building a simple QML application, run in the simulator, deploy to a device, push to the app store.</p>\n<p>We first look at the creator project and settings that are specific to iOS such as targeted devices, SDKs, required capabilities, etc. We also look at Qt Creator tooling related to simulator and devices deployment. We will also mention where Xcode is still needed, such as the initial code signing setup and the App Store submission process.</p>\n<p>After looking at a simple QML app, we investigate the coverage Qt relative to the native capabilities. In particular we'll focus on text editing, keyboard customising, keyboard avoidance, accessing the sensors (location, orientation, camera), etc.</p>\n<p>Then we look at how integrating with the native toolkits for accessing feature not covered by the QML layer. Using Objective C++ and Qt's iOS specific integration layer, we show how to access features from UIKit, and other native libraries.</p>\n<p>Finally, we will look at setting up projects to build shared components based on Qt in order to builds app extensions.</p>\n",
    "session_speaker_name": "Mike Krus",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Mike joined KDAB in 2015 as a Senior Software Engineer. His interests and expertise include software engineering, C++, QML and interactive 3D visualisation software design on desktop and mobile, which he developed previously at Midland Valley Exploration, Trimble Inc. and during his PhD in France.</p>\n"
  },
  "742": {
    "session_id": 742,
    "session_title": "Qt Quick Controls 2",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "11:30",
    "session_end_time": "12:30",
    "session_room": "a3",
    "session_pdf_title": "Qt Quick Controls 2",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt Quick enables rapid development of fluid UIs and provides all the elements necessary for creating user interfaces with QML.</p>\n<p>This talk will cover the use of Qt Quick Controls, a reusable set of UI components based on Qt Quick, and concentrate on best practices for rapid UI development for all types of applications with a focus on embedded platforms. We will cover the second generation of Controls and its new and improved architecture.</p>\n<p>We will explore how to create an application's UI with optimal code re-use by making use of existing components and the Qt Quick Controls. At the same time the branding and customizing of the application to a specific design will be taken into account. Another important aspect is the combination of QML and C++.</p>\n<p>The presentation assumes the audience has basic Qt Quick knowledge.</p>\n",
    "session_speaker_name": "Gabriel de Dietrich",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Gabriel has been working on Qt since summer 2009, making sure pixels look and feel right in Qt. He’s part of the Qt Quick Controls team, but also spends a fair share of his time on the Mac port. He has a Ph.D. in computer science specialized in image processing and medical imaging from the University of<br />\nBordeaux. When he’s not hacking pixels, Gabriel likes to play go, hike in the forests surrounding Oslo, or take his camera out to try to capture some “decisive moments”.</p>\n"
  },
  "743": {
    "session_id": 743,
    "session_title": "Integrating OpenGL with Qt Quick 2 applications",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "13:30",
    "session_end_time": "14:30",
    "session_room": "a3",
    "session_pdf_title": "Integrating OpenGL with Qt Quick 2 applications",
    "session_pdf_url": false,
    "session_abstract": "<p>One of the foundation pillars of Qt Quick 2 is its OpenGL-based rendering pipeline. By leveraging the GPU capabilities, we get 60 frames-per-second animated scenes, real time eye candy and special effects, particles, and so on. Moreover, the main programming language is QML, which is extremely popular amongst developers and designers -- it allows them to quickly prototype and build user interfaces. For these reasons, Qt Quick is becoming the de-facto choice on mobile and embedded platforms.</p>\n<p>However, can we integrate Qt Quick 2 with an existing OpenGL codebase? Would it be possible to reuse old, working, tested OpenGL code and give it a new look and feel by building a Qt Quick interface that uses it? How far can we go with that integration?</p>\n<p>In this talk, I will show the technologies available in Qt 5.4 / 5.5 that allow deep integration of Qt Quick 2 scenes with custom drawn OpenGL content. We will discuss the possibility of simply providing a Qt Quick overlay for an OpenGL scene.  The discussion will then proceed to the creation of custom Qt Quick Items drawn using raw OpenGL commands, which can then be used from QML.  Finally, I will illustrate how to manually drive Qt Quick's own rendering if we need to be in complete control of how and when the rendering happens.</p>\n<p>The audience is expected to have familiarity with basic QtQuick and OpenGL concepts, but no in-depth knowledge of them is required.</p>\n",
    "session_speaker_name": "Giuseppe D'Angelo",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Giuseppe D'Angelo holds a BSc in Computer Science. He is a long time contributor to Qt, having used Qt since 2000, and an Approver in the Qt Project. In KDAB, Giuseppe is a Software Engineer and a Trainer, working on a number of C++ and QML projects, most of them requiring OpenGL knowledge. His contributions to Qt range from containers and regular expressions to GUI and OpenGL. A free software passionate, before joining KDAB, he organized conferences on opensource around Italy, especially about Perl.</p>\n"
  },
  "744": {
    "session_id": 744,
    "session_title": "High-dpi Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "14:30",
    "session_end_time": "15:00",
    "session_room": "a3",
    "session_pdf_title": "High-dpi Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Supporting different display pixel densities is now as important as supporting different display sizes. This talk will give an overview of the existing and future high-dpi support in Qt. It will go into detail on several topics:</p>\n<p>- An introduction to the high-dpi scaling mode, also comparing it to traditional DPI scaling.<br />\n- Platform support and Qt configuration options<br />\n- Overview of API additions to Qt.<br />\n- Best practices for applications, including how to handle raster graphics assets.</p>\n",
    "session_speaker_name": "Morten Johan Sørvig",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Morten has 10 years of experience as a Qt developer. Today he functions as a platform plumber working on the Qt platform layer.</p>\n"
  },
  "745": {
    "session_id": 745,
    "session_title": "Qt, multimedia, and computer vision &#8211; a great match for Embedded Linux",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "15:30",
    "session_end_time": "16:30",
    "session_room": "a3",
    "session_pdf_title": "Qt, multimedia, and computer vision &#8211; a great match for Embedded Linux",
    "session_pdf_url": false,
    "session_abstract": "<p>In this live coding session we are going to build a cross-platform computer vision application utilizing the camera. Based on Qt Quick Controls, Qt Multimedia, and OpenCV, the application will run both on desktop platforms and Embedded Linux. The application will be developed in Qt Creator and deployed onto an i.MX6-based board running the software stack provided by Qt for Device Creation.</p>\n<p>Qt Multimedia makes creating Qt Quick applications featuring accelerated video and camera streams as a natural part of their user interface quick and painless. The new video filtering features of Qt 5.5 further enhance these capabilities: integrating 3rd party vision and image processing frameworks, like OpenCV, or accelerated algorithms implemented with GPU compute APIs, like OpenCL and CUDA, is now made simple and efficient.</p>\n<p>OpenCV (Open Source Computer Vision Library) a BSD-licensed computer vision and machine learning software library with more than 2500 optimized algorithms. Application areas include object detection, motion tracking and estimation, facial and gesture recognition, machine learning, and others. Computer vision is an area of continuously increasing focus in the mobile and embedded world. Its role is central in automotive, robotics, and augmented reality. Being a C++ framework, Qt allows easy and straightforward usage of external libraries like OpenCV.</p>\n<p>Combined with the touch-friendly user interface elements of Qt Quick Controls and the Flat style, Qt becomes an excellent choice for applications and embedded products utilizing computer vision algorithms. It is now time to see all this in action.</p>\n",
    "session_speaker_name": "Laszlo Agocs",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Laszlo is a senior software engineer at The Qt Company in Oslo, Norway. After years of UI framework development on various Nokia mobile platforms and developing mobile GPUs at ARM, he is now working full time on Qt. His focus is on graphics, platform adaptation, windowing system integration and input device handling, in particular on devices running Embedded Linux. However, in a true cross-platform Qt spirit, he is not afraid of other platforms either. He is a major contributor to QtGui, QtQuick, and is the maintainer of the embedded-focused linuxfb and eglfs platform plugins.</p>\n"
  },
  "746": {
    "session_id": 746,
    "session_title": "Building Location Analytics and Mapping into Your Apps",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "9:30",
    "session_room": "b1",
    "session_pdf_title": "Building Location Analytics and Mapping into Your Apps",
    "session_pdf_url": false,
    "session_abstract": "<p>Geolocation is a must-have element of any modern application design today. More and more applications are becoming location-aware, and the demand for geographic content, maps and functionality in mission-critical workflows is increasing all the time.  Developers need complete geolocation APIs and SDKs to build apps that can visualize and analyze maps and mapping data, and support the end user in making the most informative decisions in any situation. These SDKs must be productive, in that they are easy and intuitive to develop applications and solutions with. They must be able to build great user experiences, intuitive, easy to use, GUI and non GUI-based apps that are versatile enough to work with geo-enabled Web Services as well as data and maps that reside locally on a device, simultaneously.  These are just some of the key elements that today’s app developers need in a developer toolset.</p>\n<p>Esri’s ArcGIS Runtime SDK for Qt is a developer kit that provides all of the crucial tools and APIs for building great location-aware apps. It extends the Qt framework to assist in creating highly functional apps that can have both rich mapping and analytical capabilities, optimized to run on multiple platforms and devices, from Android, Mac and iOS devices to Windows and Linux desktops and embedded systems. This presentation discusses and demonstrates Esri’s rich, geospatial Runtime Qt SDK. Demonstrated capabilities include:</p>\n<p>- Mapping and Visualization<br />\n- Collecting, editing and managing geographic business data, online or offline</p>\n",
    "session_speaker_name": "Michael Tims",
    "session_speaker_company": "ESRI",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Michael has worked at Esri in software development for 9 years.  He has been tasked with many development roles at Esri on a variety of ArcGIS software products, emphasizing cross-platform technologies and tools.  Currently he is the Lead Software Developer for the ArcGIS Runtime SDK for Qt.  Michael obtained a Bachelor of Science in Computer Science in 2006 at California State University, San Bernardino.</p>\n"
  },
  "747": {
    "session_id": 747,
    "session_title": "The CPU Usage Analyzer for Device Creation",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:40",
    "session_end_time": "11:11",
    "session_room": "b1",
    "session_pdf_title": "The CPU Usage Analyzer for Device Creation",
    "session_pdf_url": false,
    "session_abstract": "<p>The usual approach to analyzing the CPU usage of Linux-based Qt applications is running them through valgrind, using the \"callgrind\" tool. This works well for Desktop applications and provides very accurate statistics on how an application spends its CPU time. However, for embedded devices with limited resources valgrind is not the best choice. Also, such statistics do not show the<br />\ninteraction between different threads or distinguish between idle and busy periods during the run time of an application.</p>\n<p>QtCreator 3.4 has a new CPU Usage Analyzer, specially targeted for Device Creation. It will be enabled with Boot2Qt 5.5 and it allows you to get a detailed picture of the functions where your application spends its time.</p>\n<p>The CPU Usage Analyzer provides a zoomable timeline view like the QML Profiler, so that you can see what functions are running in what threads at any given time. In future releases a statistics view will be added. The data is collected with the Linux perf tool, which is less accurate but much faster than valgrind. This way meaningful data can be collected even on resource-constrained devices.</p>\n<p>The talk will showcase the new functionality in a live demo.</p>\n",
    "session_speaker_name": "Ulf Herman",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Ulf Hermann has a degree in computer science from the Humboldt University in Berlin and has been working at Digia and The Qt Company since November 2013. His main focus are Tools for analyzing performance bottlenecks, such as the QML profiler and the CPU Usage Analyzer for Device Creation.</p>\n"
  },
  "748": {
    "session_id": 748,
    "session_title": "A deep dive into QML memory management internals",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "11:30",
    "session_end_time": "12:30",
    "session_room": "b1",
    "session_pdf_title": "A deep dive into QML memory management internals",
    "session_pdf_url": false,
    "session_abstract": "<p>Thanks to garbage collection, memory management in QML is (mostly) automatic. The application developer is relieved from the error prone task of manually taking care of memory. The drawback to this convenience is a distinctive loss of control over the handling of memory by the application developer and an overall intransparency towards the resource memory. The typical QML developer does not (and should not have to!) know about the internals of the engine. Still, given a demanding setup, the situation might arise where one needs at least a conceptual understanding of the implementation.</p>\n<p>The goal of this talk is to have a look into the black box “QML memory management” and to provide an overview on how it works internally. The talk will address questions such as:<br />\n- What for does the QML-engine need memory at all?<br />\n- Where do QML items live?<br />\n- How does the QML engine acquire its memory from the operating system?<br />\n- How is the memory managed which has been acquired by the engine?<br />\n- How does the garbage collector work?<br />\n- Why keeps the memory usage of my QML process growing?<br />\n- Why is it so hard to give memory back to the operating system?<br />\n- How has the QML memory management evolved over time - starting with Qt5.2 and introduction of the V4 engine up to today?<br />\n- What is the right tooling to profile QML memory usage?</p>\n<p>Understanding these topics provides the basis for informed design and architecture decisions. This is especially important when developing for memory constrained environments such as embedded systems. The talk will also present some hands-on tweaks and options on how to address certain problematic memory behaviors of the QML engine.</p>\n",
    "session_speaker_name": "Frank Meerkötter",
    "session_speaker_company": "basysKom GmbH",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Frank Meerkötter is the Development Lead at basysKom GmbH since 2013. He is responsible for the technical consulting in customer projects including software architecture and the high-level design. He has used Qt since Qt3 days in numerous projects, often in an embedded setting. He has a strong background in (Embedded) Linux and systems programming and holds a Master of Science in Computer Science from the University of Applied Sciences in Darmstadt/Germany.</p>\n"
  },
  "749": {
    "session_id": 749,
    "session_title": "Effective QML",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "13:30",
    "session_end_time": "14:30",
    "session_room": "b1",
    "session_pdf_title": "Effective QML",
    "session_pdf_url": false,
    "session_abstract": "<p>Writing applications with QtQuick is, as implied by the name, quite easy, and can be done by anyone after a quick introduction to the technology.  While quickly writing an application is simple, doing so in an effective, maintainable and performant manner is an important topic, especially for large and complex programs.</p>\n<p>This talk will present best practices, tips and tricks and other useful guidelines for developing QtQuick applications,  learned from years of experience from working on multiple QtQuick projects. The topics range from large-scale architectural questions like how to best handle navigation between multiple pages, layering of QML and C++ or designing a declarative API, to small details like providing correct sizing behavior for a component. Besides best practices, some common pitfalls that many people fall into are also shown, to raise awareness and help avoiding those in the future.</p>\n<p>The topics will have impact on different areas of an application: Some tips will help with the performance of the application, some introduce small tools and helpers to improve developer productivity, some will help keeping the application easy to maintain and refactor, while others shed light on complex issues, including interaction with the C++ world.</p>\n<p>The best practices mentioned in this talk cover many areas and should contain something new or interesting for everyone, hopefully helping in the goal to strive for robust quality applications.</p>\n",
    "session_speaker_name": "Thomas McGuire",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Thomas is a professional Qt developer for several years and works at KDAB as a senior software engineer, consultant and trainer. As a software engineer, he works on different customer projects, both widget-based and, increasingly, QtQuick-based, with a focus on embedded. Thomas contributes to the Qt project and has approver status there. He started working with Qt in the free software KDE project, where he maintained the mail application KMail for a long time. Thomas has a master degree in computer science and studied at the University of Siegen and the University of Edinburgh. Despite his last name, he is German and currently lives in Berlin.</p>\n"
  },
  "750": {
    "session_id": 750,
    "session_title": "Are you testing enough? Qt application Quality Insurance.",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "14:30",
    "session_end_time": "15:00",
    "session_room": "b1",
    "session_pdf_title": "Are you testing enough? Qt application Quality Insurance.",
    "session_pdf_url": false,
    "session_abstract": "<p>Have we fixed all bugs in our software? How many bugs are present in the first place? Even the latter question can be very hard to answer.</p>\n<p>Every non-trivial Qt application includes various UI controls and internal elements that all can have different states. Taking into account the asynchronous nature of events, threads, and even slot invocations, the number of possible combinations explodes quickly.</p>\n<p>Often it is neither economically acceptable nor technically feasible to test all combinations. Which ones to focus on? How many bugs may we miss by limiting our efforts?</p>\n<p>A popular metric for measuring the quality of our testing is code coverage. The most commonly used levels will be depicted and compared. Special attention will be paid to Qt-specifics like code generated by the Meta Object Compiler moc and related macros. And what about a user interface declared in QML? We will evaluate the idea of UI coverage.</p>\n<p>We will also look at approaches like \"monkey testing\" and \"fuzzing\" that promise to achieve a deeper test penetration without much extra effort. Or methologies like Pairwise Testing that help to reduce the number of combinations to test. Again, we will examine how well those techniques apply to a Qt GUI.</p>\n<p>For security critical applications the quality of Qt itself needs to be taken into account. An overview of the development process including change reviews, unit tests and Continuous Integration (CI) will be given.</p>\n<p>In the end, developers and managers will have to deal with a degree of uncertaintity. Acceptance tests that verify high-level requirements in terms of user stories can help to concentrate on most critical functionality and therefore mitigate the risk of the unknown.</p>\n",
    "session_speaker_name": "Harri Porten",
    "session_speaker_company": "froglogic",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/07/Speaker-Harri-Porten-web.jpg",
    "session_speaker_bio": "<p>Harri Porten is co-founder and co-CEO of froglogic GmbH, a company that has specialized on automated testing tools for Qt programmers. After learning about Qt through his involvement with the Open Source KDE Desktop project Harri was working as a Senior Software Engineer at the Trolltech, the original makers of Qt in Oslo.</p>\n"
  },
  "751": {
    "session_id": 751,
    "session_title": "Practical aspects of crash reporting, analytics and connectivity challenges of connected device development",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "15:30",
    "session_end_time": "16:30",
    "session_room": "b1",
    "session_pdf_title": "Practical aspects of crash reporting, analytics and connectivity challenges of connected device development",
    "session_pdf_url": false,
    "session_abstract": "<p>The session will go into technical details on what challenges were encountered during the development of a high-end optical heart-rate monitor device (PulseOn) and what technologies (both Qt and other) were used to overcome those challenges. The session will focus on three areas:</p>\n<p>- Analytics - an introduction to purely Qt-based open source analytics solution using Google Analytics as a back-end (without using any Google SDK or library). Code will be shown how to enable logging and tracking of user activities and various operational parameters of the device, and how it can be done for both QML and C++ code.</p>\n<p>- Crash reporting - how to create and utilize external crash reporting tools that work well with Qt even on mobile platforms (on the example of using CoffeeCatch on Android)</p>\n<p>- Connectivity - Bluetooth connectivity considerations, challenges, tips and tricks for interfacing with BT SPP and BT LE enabled connected devices (especially in the light of the new BT LE API launched with Qt5.4), and also SPI/I2C for smaller, wire-connected devices</p>\n<p>Finally, the three aspects will be demonstrated live on the example of the PulseOn data collection application and how they can make device development and deployment less guesswork and more a controlled process to develop quality hardware and software.</p>\n",
    "session_speaker_name": "Attila Csipa",
    "session_speaker_company": "PulseOn oy",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Attila is the Head of Software at PulseOn, a Finnish company developing high-precision optical heart rate and fitness level monitoring embedded modules and wearables aimed at the sports & fitness market. Prior to that, for several years he was the team lead in Nokia's Developer Experience Technical Consultancy unit where, as part of his duties he evangelized the use of Qt and helped developers develop and improve applications for Qt powered Nokia platforms. In total, he has over ten years of experience developing with Qt across Desktop, Mobile and Embedded device categories.</p>\n"
  },
  "752": {
    "session_id": 752,
    "session_title": "Get to know the Qt Installer Framework",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "9:30",
    "session_room": "b2",
    "session_pdf_title": "Get to know the Qt Installer Framework",
    "session_pdf_url": false,
    "session_abstract": "<p>The Qt libraries allow you to conveniently write code that runs on different platforms. However, the native channels for distributing your application (application stores, native installers, repository managers ...) do differ a lot, which makes shipping a complex application on different platforms a challenge.</p>\n<p>The Qt Installer Framework was developed to solve this issue for the Qt SDK. However, it is a generic framework that can be also used for any installer and updater that targets OS X, Windows or Linux. You can create purely offline, online, and mixed installers, and ship online updates without relying on third party services. It contains a full-blown dependency manager that manages to solve complex package dependencies. It's scripting capabilities allow you to tweak both the installer UI, as well as take additional actions on (un)installation.</p>\n<p>In the presentation we will outline the strengths and weaknesses of the Qt Installer Framework. In this hands-on part we will have a closer look at individual Qt Installer Framework capabilities, showing you how to solve the most common tasks. After the presentation you will be aware of what the Qt Installer Framework is and what its capabilities are. You will also be able to make an informed decision on whether to use it for a particular application.</p>\n",
    "session_speaker_name": "Kai Köhne",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Kai started his career 2007 at Trolltech, later on transitioning to Nokia and Digia/The Qt Company. Over the years he has been working on different part of Qt and it's tools. Nowadays he's spending most of his time on Qt Creator, the Qt Installer Framework, and the Qt SDK.</p>\n"
  },
  "753": {
    "session_id": 753,
    "session_title": "Custom Qt Creator Wizards",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:30",
    "session_end_time": "10:00",
    "session_room": "b2",
    "session_pdf_title": "Custom Qt Creator Wizards",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt Creator introduced a new JSON based wizard framework in version 3.3, which has replaced most of the old wizards, coded in C++.</p>\n<p>This presentation demonstrates the new wizards, shows how to create your own wizards and also points out their limitations and how to get around those with C++ code.</p>\n",
    "session_speaker_name": "Tobias Hunger",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Tobias is part of the Qt Tools Team in Berlin, Germany. He got his first Qt Creator patch merged into the 1.3 version and has worked on the code ever since.</p>\n"
  },
  "754": {
    "session_id": 754,
    "session_title": "Developing with Qt Location",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:10",
    "session_end_time": "10:40",
    "session_room": "b2",
    "session_pdf_title": "Developing with Qt Location",
    "session_pdf_url": false,
    "session_abstract": "<p>This presentation provides a technical introduction into the Qt Location API. </p>\n<p>This new module was released in Qt 5.5 as a technical preview and provides Mapping, Geocoding, Routing and Place features.</p>\n<p>A small QML application will be developed during this practical coding session. The main focus is on getting to know the various QML API elements and how they may be put together.</p>\n",
    "session_speaker_name": "Alex Blasche",
    "session_speaker_company": "The Qt Company",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Alex Blasche has been part of the Qt development team for more than ten years. When he joined Trolltech, he started as embedded software developer using Qt 2.3. Later he contributed to Qtopia/Qt Extended and in 2008 became technical lead for the design and development of the Qt Mobility APIs. Following the announcement of Qt 5 he continued the Mobility effort by porting the API’s to Qt 5 and is the maintainer for some of them. Currently he works on Qt Bluetooth, QtNfc, Qt Positioning & QtLocation and maintains Qt's Jira system.</p>\n"
  },
  "755": {
    "session_id": 755,
    "session_title": "Among ELFs and DWARFs",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "10:40",
    "session_end_time": "11:10",
    "session_room": "b2",
    "session_pdf_title": "Among ELFs and DWARFs",
    "session_pdf_url": false,
    "session_abstract": "<p>When debugging a problem or optimizing performance we tend to look at the source code of our application and its runtime behavior. There is however a third form of our program we can look at that is far less often used for this purpose, the compiled binary. While this obviously isn't the right form to work with in many scenarios, it does provide us with valuable information when dealing with start-up performance, memory consumption, plug-in loading issues or bizarre runtime behavior for example.</p>\n<p>In this talk we will look at various useful information we can find in compiled libraries or executables, with a special focus on Qt related use-cases. Exploring a binary for example shows implications of Qt's various ways of dealing with string literals, how to debug Qt plug-in loading issues, or why member function pointer signal/slot connections can fail in surprising ways. We will also cover some of the tools available for inspecting binary files, relevant linker flags and their impact, and ways to look into the very early, pre-main phases of application runtime.</p>\n<p>As the title suggests examples will primarily focus on the ELF format used on Linux, Android and other UNIX systems as well as QNX, but due to their common ancestry you will find most concepts and ideas also applying to PE and Mach-O.</p>\n",
    "session_speaker_name": "Volker Krause",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Volker is a Senior Software Engineer at KDAB. He has been developing with Qt for more than ten years now. Volker works in Berlin's KDAB office as a team lead, consultant and trainer. His experience with Qt spans desktop and embedded platforms, with a focus on software architecture and tooling. He has taught many 'Programming with Qt' trainings throughout Europe and is a long-term contributor to KDE and Qt. In 2010 Volker started the GammaRay project to address the need for QML debugging tools (which did not yet exist at this time), and has lead the project since then.</p>\n"
  },
  "756": {
    "session_id": 756,
    "session_title": "Creating multithreaded applications with Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "11:30",
    "session_end_time": "12:30",
    "session_room": "b2",
    "session_pdf_title": "Creating multithreaded applications with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>In Qt, there are a lot of options for building multithreaded applications: Using QThread directly, Qt Concurrent, QFuture etc.</p>\n<p>Given the multitude of options, it's common for developers to be confused about which one they should choose for certain problems. So they choose one of them, learn this one, and stay with it for all their threaded work. That's too bad, when Qt offers better tools for some of the code they are working on.</p>\n<p>For the desktop, most of us have systems with many cores, that would allow the applications to run much faster, if the developers can use those tools correctly. This is increasingly also the case for applications running on embedded systems, phones or tablets, as the newer processors have an increasing number of cores.</p>\n<p>I will go through those options, show how to use each of them, and give examples of what each of the solutions would be useful for. I will also talk about the performance implications of the different approaches. I will also discuss when to avoid threads and instead focus on using the power of the event driven programming that Qt offers.</p>\n<p>This will give the developer the information needed to make the right choice next time he is faced with the decision of what type of threading technology to use.</p>\n",
    "session_speaker_name": "Bo Thorsen",
    "session_speaker_company": "Viking Software",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Bo Thorsen has been a Qt developer for many years, writing Qt based applications of all sorts and varieties. He is very well known in the Qt community from giving Developer Days talks and helping out on the Qt mailing lists. He is an experienced speaker that always gives the audience a presentation packed full of the deep knowledge coming from true expertise in a very entertaining way.</p>\n"
  },
  "757": {
    "session_id": 757,
    "session_title": "Reactive programming and Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "13:30",
    "session_end_time": "14:30",
    "session_room": "b2",
    "session_pdf_title": "Reactive programming and Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Reactive programming is an emerging discipline which achieves concurrency using events-based programming. Today, It is mostly used for writing very scalable web services that can achieve high concurrency levels even on a single thread.</p>\n<p>The concept is simple - make a system that is fully event-based, and look at events not as isolated instances, but as streams. When we have streams, we can manipulate them as if they were simple ranges. We can filter them, modify them, combine multiple streams into one etc.</p>\n<p>Reactive programming is not only applicable to the web services, it can be used in any event-based environment. In our case, in normal Qt applications, to enrich the power of signals and slots.</p>\n<p>The talk will consist of two parts. In the first part, ranges will be explained (through the boost.range library, and Eric Niebler's range library proposal for C++17). We will show that ranges, and range transformations are a natural extension to the <algorithm> library in STL, which allows writing more concise and safe code that deals with collection structures like lists, vectors or maps.</p>\n<p>The second part will deal with what reactive streams are, and their relation to ranges. We will show how to create streams using Qt's signals and slots mechanism, how to manipulate them, and connect the transformed streams back to the UI or other application components.</p>\n<p>We will show a multitude of examples of how this can make the code more composable, clean and more declarative.</p>\n<p>The examples will require some prior C++11/14 knowledge, while the features needed from the forthcoming C++17 standard will be explained.</p>\n",
    "session_speaker_name": "Ivan Čukić",
    "session_speaker_company": "KDE",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Ivan is a long time KDE contributor mainly working on the Plasma workspace, and lower-level frameworks for tracking and managing user actions. Maintainer and main developer of the KActivities framework, Contour daemon and Lancelot. He is an active advocate of modern C++ practices, mixed with functional programming concepts. He is a doctoral candidate (PhDc) at the Computer Science department of the Faculty of Mathematics, University of Belgrade with main research revolving around the programming language design.</p>\n"
  },
  "758": {
    "session_id": 758,
    "session_title": "Qt Value Class Design",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "14:30",
    "session_end_time": "15:30",
    "session_room": "b2",
    "session_pdf_title": "Qt Value Class Design",
    "session_pdf_url": false,
    "session_abstract": "<p>Qt is well-known for its excellent higher-level APIs, from QtQuick/QML over QtWidgets to the very central QObject class hierarchy. Consequently, this is what training material has rightfully been focused on. But holding together the fabric of JavaScript and C++ higher-level APIs is a plethora of value classes, that is, classes that are are designed to behave like built-in types such as int.</p>\n<p>You use these classes every day in your Qt work: From QString, QByteArray, QVariant over QSize, QPoint, QRect and their -F variants, to the collection classes such as QVector, QStringList and QHash, and finally drawing classes such as QColor, QPen, QBrush, QPolygon and QPainterPath. And that's just scratching the surface of QtCore and QtGui.</p>\n<p>Unlike polymorphic classes, which are designed for inheritance and gently guide your subclass design by the knobs they expose (protected and virtual members, say), value classes have to be designed from scratch each time one is needed.</p>\n<p>At the same time, value classes tend to affect the performance of your programs in more profound ways than polymorphic classes ever could. Who hasn't started out passing QStrings around by value instead of reference-to-const, and then wondered why QAtomicInt functions top the list of call counts, or even time spent in performance profile data?</p>\n<p>Likewise, failure to introduce a value class over a tuple of values (say, two ints instead of a Point class) makes for hard-to use (for humans) and hard-to-optimize (for compilers) APIs.</p>\n<p>In this presentation, we'll take a deep dive into value class design, in particular, but not exclusively, from a performance point of view. You will learn how your compiler sees your code and how you can level the playing field again. But we'll also cover API design and binary compatibility issues.</p>\n<p>We'll start by classifying the different approaches used to write value classes and then present specific guidelines for each of these. You will learn how to make your value classes compact and fast, easy to use, and extensible.</p>\n<p>The presentation targets an audience with intermediate to expert Qt knowledge. Some familiarity with features new in C++11/14 is highly beneficial, too. In particular, we will not explain the Qt classes that we use, and will only very briefly describe new C++11/14 feature we may be using in the code.</p>\n<p>Beginners are welcome, too, but may want to read up on the above-mentioned topics to get the maximum out of this presentation.</p>\n",
    "session_speaker_name": "Marc Mutz",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Marc Mutz is a Senior Software Engineer, Trainer, and Consultant with KDAB – The Qt Experts. Starting out around the turn of the century as a KMail/Kontact Core Developer, he has since wandered down the software stack to become a major contributor to the Qt Project, and maintainer of its QtWidgets module.</p>\n<p>Having taught more than 25 multi-day Qt trainings to companies such as Schlumberger, EADS and Siemens, he was also among the first batch of Qt developers certified by Nokia’s now-defunct Qt certification programme in 2009.</p>\n<p>Marc is recently enjoying his new role as parent and—increasingly less so—as a house builder.</p>\n"
  },
  "759": {
    "session_id": 759,
    "session_title": "Developer Unconference Track &#038; Lightning Talks",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:00",
    "session_end_time": "16:30",
    "session_room": "b3",
    "session_pdf_title": "Developer Unconference Track &#038; Lightning Talks",
    "session_pdf_url": false,
    "session_abstract": "<p>Coming soon</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "760": {
    "session_id": 760,
    "session_title": "Closing Wrap-Up",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "16:30",
    "session_end_time": "17:00",
    "session_room": "a1",
    "session_pdf_title": "Closing Wrap-Up",
    "session_pdf_url": false,
    "session_abstract": "<p>Closing remarks</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "761": {
    "session_id": 761,
    "session_title": "Keynote presentations",
    "session_text_only": false,
    "session_day": "Tuesday",
    "session_start_time": "9:00",
    "session_end_time": "12:00",
    "session_room": "a1",
    "session_pdf_title": "Keynote presentations",
    "session_pdf_url": false,
    "session_abstract": "<p>Keynotes from the makers of Qt and top industry leaders. Stay tuned for more!</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "763": {
    "session_id": 763,
    "session_title": "Pre-conference Training: Introduction to QML – also known as Qt Quick",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Introduction to QML – also known as Qt Quick",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Developers and managers interested in learning the autonomy of a QML application.</p>\n<p>Prerequisite: Knowing the basics of Qt at C++ level is an advantage but not a requirement.</p>\n<p>This training is an introduction to Qt Quick. On the one hand it will teach you how to compose fluid user interfaces with slick animations using the QML language. On the other hand it will teach you how you hook the QML side up to your business logic in C++.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "765": {
    "session_id": 765,
    "session_title": "Pre-conference Training: Model/View programming in Qt",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Model/View programming in Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Qt developers interested in model/view either from QML or from Qt Widgets.</p>\n<p>Prerequisite: Existing Qt knowledge.</p>\n<p>A key ingredient in successful software development is the separation of presentation and business logic. Everyone knows that. A larger part of most applications is a list of things, and for those, Qt offers such separation using a model/view framework.</p>\n<p>This presentation will introduce this framework and tell you how to develop models independent of whether they are to be displayed in a C++/Qt application or in a Qt Quick application.</p>\n<p>The training dive into subjects such as:</p>\n<p>- The API to implement for use in a 1 dimensional list, a 2 dimensional table and a tree view<br />\n- What model indexes are all about<br />\n- How to successfully implement a proxy model<br />\n- How to debug your models<br />\n- How to implement models in C++ that are displayed in Qt Quick.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "767": {
    "session_id": 767,
    "session_title": "Pre-conference Training: Debugging and Profiling Qt applications",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Debugging and Profiling Qt applications",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Developers who want to find and fix problems</p>\n<p>Prerequisite: Knowing the basics of C++, Qt and QML</p>\n<p>This training gives an introduction to various tools, which help developers and testers in finding bugs and performance issues.</p>\n<p>The tools presented cover a wide range of problems, from general purpose debugging and CPU profiling to Qt specific high-level analyzers. Often, it is relatively simple to run a tool, but interpreting the results, or even just using some of the more advanced tools, requires deep technical knowledge.</p>\n<p>The most important tools on all major platforms that Qt supports, i.e. Linux, Windows, Mac OSX, iOS and Android, will be covered:</p>\n<p>debugging</p>\n<p>- general purpose debuggers: GDB, LLDB, Windows Debugging Tools<br />\n- memory error detectors: valgrind’s memcheck, Dr. Memory, AddressSanitizer<br />\n- thread error detectors: valgrind’s helgrind, ThreadSanitizer<br />\n- OpenGL: apitrace, XCode<br />\n- various Qt-builtin features for logging, QML, WebKit, WebEngine, DBUS etc.<br />\n- GammaRay to investigate internals of Qt applications</p>\n<p>profiling</p>\n<p>- CPU: valgrind’s callgrind, Linux perf, Intel® VTune™ Amplifier, Instruments, Visual Studio<br />\n- heap memory: valgrind’s massif, heaptrack, Instruments, Visual Studio<br />\n- OpenGL: apitrace, vogl, NVidia nSight, AMD CodeXL, Vivante vProfile</p>\n<p>testing</p>\n<p>- Qt TestLib: unit tests and benchmarks<br />\n- Squish: testing graphical<br />\n- static code analysis: qmllint, clang analyzer, coverity<br />\n- code coverage</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "770": {
    "session_id": 770,
    "session_title": "Pre-conference Training: Introduction to Multithreaded Programming with Qt",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Introduction to Multithreaded Programming with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Qt Developers interested in multithreaded development.</p>\n<p>Prerequisite: Existing Qt knowledge. Basic understanding of multithreaded programming is also an advantage.</p>\n<p>With more and more cores in computers, multithreaded programming is becoming increasingly important for developers. Qt offers several mechanisms for multithreading, however, it is up to you to decide which to use when so that you steer clear of common pitfalls.</p>\n<p>This training will introduce you to multithreading concepts in general, tell you about the different mechanism in Qt, and discuss best practices and common pitfalls.</p>\n<p>It is a requirement that you at least know the basics of Qt for this training.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "771": {
    "session_id": 771,
    "session_title": "Pre-conference Training: Introduction to Modern OpenGL with Qt",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Introduction to Modern OpenGL with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Developers interested in learning the basics of OpenGL.</p>\n<p>Prerequisite: A basic level of linear algebra will be assumed for this course (multiplying a matrix and a vector). Mathematics will be kept to a bare minimum so as not to get in the way of eye candy!</p>\n<p>OpenGL is a central part of QtQuick2 in Qt 5 and also plays a key role in displaying the main content of many widget-based applications.</p>\n<p>OpenGL has been around for many years and in recent times has evolved to shed much of its legacy baggage and better expose the underlying hardware. Modern OpenGL allows us to take full advantage of the enormous power and parallel processing power of today’s GPUs. Maximizing performance of OpenGL rendering requires us to understand how GPUs work and how to efficiently feed them with data.</p>\n<p>Qt provides a number of classes to make life easier when working with modern OpenGL. This training will show you how to do the basic tasks associated with OpenGL rendering and will go on to show how to use Qt and OpenGL to achieve a number of rendering effects and algorithms. You will also learn how to write custom QtQuick2 items using the OpenGL and scene graph APIs.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "772": {
    "session_id": 772,
    "session_title": "Pre-conference Training: What&#8217;s new in C++11/C++14? (with a Qt5 focus)",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: What&#8217;s new in C++11/C++14? (with a Qt5 focus)",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: C++ developers who want to upgrade their C++ skills</p>\n<p>Prerequisite: Knowing the basics of C++ (the old standard) is a requirement, though more advanced topics will be explained as needed. Knowing the basics of Qt is beneficial, but not required.</p>\n<p>This training is targeted at people who are interested to combine the new features of C++11/C++14 with Qt5 (and, to a lesser extent, Qt 4.8). It will teach you all about the new C++11/C++14 features, but also throws in Qt-specific information, including how to structure your code so that a simple recompile with a C++14 compiler will make your applications both faster and use less memory.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "773": {
    "session_id": 773,
    "session_title": "Pre-conference Training: Qt for Mobile Platforms &#8211; Android/iOS",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Qt for Mobile Platforms &#8211; Android/iOS",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Anyone interested in the process of developing with Qt for mobile platforms</p>\n<p>Prerequisite: Basic Qt knowledge is beneficial.</p>\n<p>This presentation will introduce the tools and processes needed to develop with Qt for mobile devices, including Android and iOS.</p>\n<p>The agenda for the day will approximately look like this:</p>\n<p>- Installing and setting up Qt for Android<br />\n- Installing and setting up Qt for iOS<br />\n- Use case: Targeting desktop and mobile devices using Qt<br />\n- Device independent development – how do you cope with devices of vastly different resolutions and screen density</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "774": {
    "session_id": 774,
    "session_title": "Pre-conference Training: Introduction to Testing Qt applications with Squish",
    "session_text_only": false,
    "session_day": "Monday",
    "session_start_time": "9:00",
    "session_end_time": "18:00",
    "session_room": "a1",
    "session_pdf_title": "Pre-conference Training: Introduction to Testing Qt applications with Squish",
    "session_pdf_url": false,
    "session_abstract": "<p>Target Audience: Testers, Developers and Managers interested in how to automate testing of Qt applications.</p>\n<p>Prerequisite: Knowing the basics of Qt and especially software development is a benefit for this presentation.</p>\n<p>Unit testing will only take you so far when a graphics system is involved. If you want to be sure that the overall system works, then you need to blackbox test it too. The tool for automating that in the Qt world is Squish.</p>\n<p>Squish is a record and playback tool, that can be used as is, but to get the most out of it a more structural approach is suggested. This training will introduce Squish and the refactoring approach that KDAB has successfully implemented in multiple large organizations.</p>\n",
    "session_speaker_name": "Trainer",
    "session_speaker_company": "KDAB",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>KDAB trainers qualify themselves by years of real-life, large-scale development experience as well as strong backgrounds in teaching.</p>\n"
  },
  "780": {
    "session_id": 780,
    "session_title": "QtMozEmbed: Embedding Gecko with Qt 5",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:30",
    "session_end_time": "10:00",
    "session_room": "b1",
    "session_pdf_title": "QtMozEmbed: Embedding Gecko with Qt 5",
    "session_pdf_url": false,
    "session_abstract": "<p>Coming soon</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "781": {
    "session_id": 781,
    "session_title": "Building a Web Application Framework with Qt",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "15:30",
    "session_end_time": "16:30",
    "session_room": "b2",
    "session_pdf_title": "Building a Web Application Framework with Qt",
    "session_pdf_url": false,
    "session_abstract": "<p>Coming soon</p>\n",
    "session_speaker_name": "Speaker to be announced",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>To be announced</p>\n"
  },
  "809": {
    "session_id": 809,
    "session_title": "QtMozEmbed: Embedding Gecko with Qt5",
    "session_text_only": false,
    "session_day": "Wednesday",
    "session_start_time": "9:30",
    "session_end_time": "10:00",
    "session_room": "b1",
    "session_pdf_title": "QtMozEmbed: Embedding Gecko with Qt5",
    "session_pdf_url": false,
    "session_abstract": "<p>QtMozEmbed is an open source project, started by Oleg Romashin, that is built upon Embedlite embedding API to embed the Gecko web browser engine to Qt applications.</p>\n<p>The QtMozEmbed can be divided into two main components; context and view.</p>\n<p>The context is the one that starts the Gecko web browser engine by starting the gecko message loop. Through the context API user can set and read preferences and subscribe to observe browser global JSON message for instance about download status.</p>\n<p>The view provides necessary APIs to implement basic browsing functions like loading urls, and going back and forth in web pages. In addition, it maps Qt events (mouse, touch, key, input, and focus) to gecko events or Embedlite embedding API calls. Furthermore, it provides low level asynchronous JSON API to register message listeners, receive messages from the engine, and respond to the messages. You can register to listen messages about alerts, warnings, confirms, prompts, authentication dialogs, password management, single and multi select, location request, and so forth. So the view component is not responsible for rendering web prompts only the web content itself.</p>\n<p>In this talk we focus to the low level JSON APIs provided by the QtMozEmbed that allows flexible integration to a QML user interface.</p>\n",
    "session_speaker_name": "Siteshwar Vashisht & Raine Mäkeläinen",
    "session_speaker_company": "",
    "session_speaker_img_url": "http://www.qtworldsummit.com/wp-content/uploads/2015/03/biglinks_speakers.jpg",
    "session_speaker_bio": "<p>Siteshwar Vashisht, Red Hat Inc.<br />\nSiteshwar Vashisht is a Qt fanatic who has been using Qt from more than 6 years. He is a maintainer of fish shell and contributor in a number of Open Source projects including KDE, Sailfish OS etc. Currently he works for Red Hat where he is primarily responsible for maintaining Desktop components for Red Hat Enterprise Linux.</p>\n<p>Raine Mäkeläinen, Jolla<br />\nRaine Mäkeläinen, a seasoned QML developer involved with Qt projects for roughly 7 years. Currently works at Jolla across the different verticals of the Sailfish OS stack. He is one of the core developers behind Sailfish Browser. He is known for his contributions to QML components of different mobile platforms and Qt Web Runtime. </p>\n"
  }
}